[Killed] Block removal mutation
MeetingCommentingConfigurations/Events/MeetingCommentingConfigurationCreatedDomainEvent.cs:13:9
         public bool IsEnabled { get; }
 
         public MeetingCommentingConfigurationCreatedDomainEvent(MeetingId meetingId, bool isEnabled)
-        {
-            MeetingId = meetingId;
-            IsEnabled = isEnabled;
-        }
+        {}
     }
 }
