[Killed] Block removal mutation
MeetingCommentingConfigurations/Events/MeetingCommentingDisabledDomainEvent.cs:11:9
         public MeetingId MeetingId { get; }
 
         public MeetingCommentingDisabledDomainEvent(MeetingId meetingId)
-        {
-            MeetingId = meetingId;
-        }
+        {}
     }
 }
