[Killed] Block removal mutation
MeetingCommentingConfigurations/Events/MeetingCommentingEnabledDomainEvent.cs:11:9
         public MeetingId MeetingId { get; }
 
         public MeetingCommentingEnabledDomainEvent(MeetingId meetingId)
-        {
-            MeetingId = meetingId;
-        }
+        {}
     }
 }
