[Killed] Block removal mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:20:9
         private bool _isCommentingEnabled;
 
         private MeetingCommentingConfiguration(MeetingId meetingId)
-        {
-            this.Id = new MeetingCommentingConfigurationId(Guid.NewGuid());
-            this._meetingId = meetingId;
-            this._isCommentingEnabled = true;
-
-            this.AddDomainEvent(new MeetingCommentingConfigurationCreatedDomainEvent(this._meetingId, this._isCommentingEnabled));
-        }
+        {}
 
         private MeetingCommentingConfiguration()

[Killed] Boolean mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:23:41
         {
             this.Id = new MeetingCommentingConfigurationId(Guid.NewGuid());
             this._meetingId = meetingId;
-            this._isCommentingEnabled = true;
+            this._isCommentingEnabled = false;
 
             this.AddDomainEvent(new MeetingCommentingConfigurationCreatedDomainEvent(this._meetingId, this._isCommentingEnabled));

[Killed] Statement mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:25:13
             this._meetingId = meetingId;
             this._isCommentingEnabled = true;
 
-            this.AddDomainEvent(new MeetingCommentingConfigurationCreatedDomainEvent(this._meetingId, this._isCommentingEnabled));
+            ;
         }
 

[Killed] Block removal mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:34:9
         }
 
         public void EnableCommenting(MemberId enablingMemberId, MeetingGroup meetingGroup)
-        {
-            CheckRule(new MeetingCommentingCanBeEnabledOnlyByGroupOrganizerRule(enablingMemberId, meetingGroup));
-
-            if (!this._isCommentingEnabled)
-            {
-                this._isCommentingEnabled = true;
-                AddDomainEvent(new MeetingCommentingEnabledDomainEvent(this._meetingId));
-            }
-        }
+        {}
 
         public void DisableCommenting(MemberId disablingMemberId, MeetingGroup meetingGroup)

[Killed] Statement mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:35:13
 
         public void EnableCommenting(MemberId enablingMemberId, MeetingGroup meetingGroup)
         {
-            CheckRule(new MeetingCommentingCanBeEnabledOnlyByGroupOrganizerRule(enablingMemberId, meetingGroup));
+            ;
 
             if (!this._isCommentingEnabled)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:37:17
         {
             CheckRule(new MeetingCommentingCanBeEnabledOnlyByGroupOrganizerRule(enablingMemberId, meetingGroup));
 
-            if (!this._isCommentingEnabled)
+            if (this._isCommentingEnabled)
             {
                 this._isCommentingEnabled = true;

[Killed] Block removal mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:38:13
             CheckRule(new MeetingCommentingCanBeEnabledOnlyByGroupOrganizerRule(enablingMemberId, meetingGroup));
 
             if (!this._isCommentingEnabled)
-            {
-                this._isCommentingEnabled = true;
-                AddDomainEvent(new MeetingCommentingEnabledDomainEvent(this._meetingId));
-            }
+            {}
         }
 

[Survived] Boolean mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:39:45
 
             if (!this._isCommentingEnabled)
             {
-                this._isCommentingEnabled = true;
+                this._isCommentingEnabled = false;
                 AddDomainEvent(new MeetingCommentingEnabledDomainEvent(this._meetingId));
             }

[Killed] Statement mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:40:17
             if (!this._isCommentingEnabled)
             {
                 this._isCommentingEnabled = true;
-                AddDomainEvent(new MeetingCommentingEnabledDomainEvent(this._meetingId));
+                ;
             }
         }

[Killed] Block removal mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:45:9
         }
 
         public void DisableCommenting(MemberId disablingMemberId, MeetingGroup meetingGroup)
-        {
-            CheckRule(new MeetingCommentingCanBeDisabledOnlyByGroupOrganizerRule(disablingMemberId, meetingGroup));
-
-            if (this._isCommentingEnabled)
-            {
-                this._isCommentingEnabled = false;
-                AddDomainEvent(new MeetingCommentingDisabledDomainEvent(this._meetingId));
-            }
-        }
+        {}
 
         public bool GetIsCommentingEnabled() => _isCommentingEnabled;

[Killed] Statement mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:46:13
 
         public void DisableCommenting(MemberId disablingMemberId, MeetingGroup meetingGroup)
         {
-            CheckRule(new MeetingCommentingCanBeDisabledOnlyByGroupOrganizerRule(disablingMemberId, meetingGroup));
+            ;
 
             if (this._isCommentingEnabled)

[Killed] Negate expression
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:48:17
         {
             CheckRule(new MeetingCommentingCanBeDisabledOnlyByGroupOrganizerRule(disablingMemberId, meetingGroup));
 
-            if (this._isCommentingEnabled)
+            if (!(this._isCommentingEnabled))
             {
                 this._isCommentingEnabled = false;

[Killed] Block removal mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:49:13
             CheckRule(new MeetingCommentingCanBeDisabledOnlyByGroupOrganizerRule(disablingMemberId, meetingGroup));
 
             if (this._isCommentingEnabled)
-            {
-                this._isCommentingEnabled = false;
-                AddDomainEvent(new MeetingCommentingDisabledDomainEvent(this._meetingId));
-            }
+            {}
         }
 

[Killed] Boolean mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:50:45
 
             if (this._isCommentingEnabled)
             {
-                this._isCommentingEnabled = false;
+                this._isCommentingEnabled = true;
                 AddDomainEvent(new MeetingCommentingDisabledDomainEvent(this._meetingId));
             }

[Killed] Statement mutation
MeetingCommentingConfigurations/MeetingCommentingConfiguration.cs:51:17
             if (this._isCommentingEnabled)
             {
                 this._isCommentingEnabled = false;
-                AddDomainEvent(new MeetingCommentingDisabledDomainEvent(this._meetingId));
+                ;
             }
         }
