[Killed] Block removal mutation
MeetingCommentingConfigurations/Rules/MeetingCommentingCanBeDisabledOnlyByGroupOrganizerRule.cs:13:9
         private readonly MemberId _disablingMemberId;
 
         public MeetingCommentingCanBeDisabledOnlyByGroupOrganizerRule(MemberId disablingMemberId, MeetingGroup meetingGroup)
-        {
-            _meetingGroup = meetingGroup;
-            _disablingMemberId = disablingMemberId;
-        }
+        {}
 
         public bool IsBroken() => !_meetingGroup.IsOrganizer(_disablingMemberId);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingCommentingConfigurations/Rules/MeetingCommentingCanBeDisabledOnlyByGroupOrganizerRule.cs:18:35
             _disablingMemberId = disablingMemberId;
         }
 
-        public bool IsBroken() => !_meetingGroup.IsOrganizer(_disablingMemberId);
+        public bool IsBroken() => _meetingGroup.IsOrganizer(_disablingMemberId);
 
         public string Message => "Commenting for meeting can be disabled only by group organizer";
