[Killed] Block removal mutation
MeetingCommentingConfigurations/Rules/MeetingCommentingCanBeEnabledOnlyByGroupOrganizerRule.cs:13:9
         private readonly MemberId _enablingMemberId;
 
         public MeetingCommentingCanBeEnabledOnlyByGroupOrganizerRule(MemberId enablingMemberId, MeetingGroup meetingGroup)
-        {
-            _meetingGroup = meetingGroup;
-            _enablingMemberId = enablingMemberId;
-        }
+        {}
 
         public bool IsBroken() => !_meetingGroup.IsOrganizer(_enablingMemberId);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingCommentingConfigurations/Rules/MeetingCommentingCanBeEnabledOnlyByGroupOrganizerRule.cs:18:35
             _enablingMemberId = enablingMemberId;
         }
 
-        public bool IsBroken() => !_meetingGroup.IsOrganizer(_enablingMemberId);
+        public bool IsBroken() => _meetingGroup.IsOrganizer(_enablingMemberId);
 
         public string Message => "Commenting for meeting can be enabled only by group organizer";

[Survived] String mutation
MeetingCommentingConfigurations/Rules/MeetingCommentingCanBeEnabledOnlyByGroupOrganizerRule.cs:20:34
 
         public bool IsBroken() => !_meetingGroup.IsOrganizer(_enablingMemberId);
 
-        public string Message => "Commenting for meeting can be enabled only by group organizer";
+        public string Message => "";
     }
 }
