[Killed] Block removal mutation
MeetingComments/Events/MeetingCommentAddedDomainEvent.cs:15:9
         public string Comment { get; }
 
         public MeetingCommentAddedDomainEvent(MeetingCommentId meetingCommentId, MeetingId meetingId, string comment)
-        {
-            MeetingCommentId = meetingCommentId;
-            MeetingId = meetingId;
-            Comment = comment;
-        }
+        {}
     }
 }
