[Killed] Block removal mutation
MeetingComments/Events/MeetingCommentEditedDomainEvent.cs:12:9
         public string EditedComment { get; }
 
         public MeetingCommentEditedDomainEvent(MeetingCommentId meetingCommentId, string editedComment)
-        {
-            MeetingCommentId = meetingCommentId;
-            EditedComment = editedComment;
-        }
+        {}
     }
 }
