[Killed] Block removal mutation
MeetingComments/Events/MeetingCommentRemovedDomainEvent.cs:10:9
         public MeetingCommentId MeetingCommentId { get; }
 
         public MeetingCommentRemovedDomainEvent(MeetingCommentId meetingCommentId)
-        {
-            MeetingCommentId = meetingCommentId;
-        }
+        {}
     }
 }
