[Killed] Block removal mutation
MeetingComments/Events/ReplyToMeetingCommentAddedDomainEvent.cs:14:9
         public string Reply { get; }
 
         public ReplyToMeetingCommentAddedDomainEvent(MeetingCommentId meetingCommentId, MeetingCommentId inReplyToCommentId, string reply)
-        {
-            MeetingCommentId = meetingCommentId;
-            InReplyToCommentId = inReplyToCommentId;
-            Reply = reply;
-        }
+        {}
     }
 }
