[Killed] Statement mutation
MeetingComments/MeetingComment.cs:44:13
             MeetingCommentingConfiguration meetingCommentingConfiguration,
             MeetingGroup meetingGroup)
         {
-            this.CheckRule(new CommentTextMustBeProvidedRule(comment));
+            ;
             this.CheckRule(new CommentCanBeCreatedOnlyIfCommentingForMeetingEnabledRule(meetingCommentingConfiguration));
             this.CheckRule(new CommentCanBeAddedOnlyByMeetingGroupMemberRule(authorId, meetingGroup));

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:45:13
             MeetingGroup meetingGroup)
         {
             this.CheckRule(new CommentTextMustBeProvidedRule(comment));
-            this.CheckRule(new CommentCanBeCreatedOnlyIfCommentingForMeetingEnabledRule(meetingCommentingConfiguration));
+            ;
             this.CheckRule(new CommentCanBeAddedOnlyByMeetingGroupMemberRule(authorId, meetingGroup));
 

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:46:13
         {
             this.CheckRule(new CommentTextMustBeProvidedRule(comment));
             this.CheckRule(new CommentCanBeCreatedOnlyIfCommentingForMeetingEnabledRule(meetingCommentingConfiguration));
-            this.CheckRule(new CommentCanBeAddedOnlyByMeetingGroupMemberRule(authorId, meetingGroup));
+            ;
 
             this.Id = new MeetingCommentId(Guid.NewGuid());

[Survived] Boolean mutation
MeetingComments/MeetingComment.cs:58:26
             _createDate = SystemClock.Now;
             _editDate = null;
 
-            _isRemoved = false;
+            _isRemoved = true;
             _removedByReason = null;
 

[Killed] Equality mutation
MeetingComments/MeetingComment.cs:61:17
             _isRemoved = false;
             _removedByReason = null;
 
-            if (inReplyToCommentId == null)
+            if (inReplyToCommentId != null)
             {
                 this.AddDomainEvent(new MeetingCommentAddedDomainEvent(this.Id, _meetingId, comment));

[Killed] Block removal mutation
MeetingComments/MeetingComment.cs:62:13
             _removedByReason = null;
 
             if (inReplyToCommentId == null)
-            {
-                this.AddDomainEvent(new MeetingCommentAddedDomainEvent(this.Id, _meetingId, comment));
-            }
+            {}
             else
             {

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:63:17
 
             if (inReplyToCommentId == null)
             {
-                this.AddDomainEvent(new MeetingCommentAddedDomainEvent(this.Id, _meetingId, comment));
+                ;
             }
             else

[Killed] Block removal mutation
MeetingComments/MeetingComment.cs:66:13
                 this.AddDomainEvent(new MeetingCommentAddedDomainEvent(this.Id, _meetingId, comment));
             }
             else
-            {
-                this.AddDomainEvent(new ReplyToMeetingCommentAddedDomainEvent(this.Id, inReplyToCommentId, comment));
-            }
+            {}
         }
 

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:67:17
             }
             else
             {
-                this.AddDomainEvent(new ReplyToMeetingCommentAddedDomainEvent(this.Id, inReplyToCommentId, comment));
+                ;
             }
         }

[Killed] Block removal mutation
MeetingComments/MeetingComment.cs:77:9
         }
 
         public void Edit(MemberId editorId, string editedComment, MeetingCommentingConfiguration meetingCommentingConfiguration)
-        {
-            this.CheckRule(new CommentTextMustBeProvidedRule(editedComment));
-            this.CheckRule(new MeetingCommentCanBeEditedOnlyByAuthorRule(this._authorId, editorId));
-            this.CheckRule(new CommentCanBeEditedOnlyIfCommentingForMeetingEnabledRule(meetingCommentingConfiguration));
-
-            _comment = editedComment;
-            _editDate = SystemClock.Now;
-
-            this.AddDomainEvent(new MeetingCommentEditedDomainEvent(this.Id, editedComment));
-        }
+        {}
 
         public void Remove(MemberId removingMemberId, MeetingGroup meetingGroup, string reason = null)

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:78:13
 
         public void Edit(MemberId editorId, string editedComment, MeetingCommentingConfiguration meetingCommentingConfiguration)
         {
-            this.CheckRule(new CommentTextMustBeProvidedRule(editedComment));
+            ;
             this.CheckRule(new MeetingCommentCanBeEditedOnlyByAuthorRule(this._authorId, editorId));
             this.CheckRule(new CommentCanBeEditedOnlyIfCommentingForMeetingEnabledRule(meetingCommentingConfiguration));

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:79:13
         public void Edit(MemberId editorId, string editedComment, MeetingCommentingConfiguration meetingCommentingConfiguration)
         {
             this.CheckRule(new CommentTextMustBeProvidedRule(editedComment));
-            this.CheckRule(new MeetingCommentCanBeEditedOnlyByAuthorRule(this._authorId, editorId));
+            ;
             this.CheckRule(new CommentCanBeEditedOnlyIfCommentingForMeetingEnabledRule(meetingCommentingConfiguration));
 

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:80:13
         {
             this.CheckRule(new CommentTextMustBeProvidedRule(editedComment));
             this.CheckRule(new MeetingCommentCanBeEditedOnlyByAuthorRule(this._authorId, editorId));
-            this.CheckRule(new CommentCanBeEditedOnlyIfCommentingForMeetingEnabledRule(meetingCommentingConfiguration));
+            ;
 
             _comment = editedComment;

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:85:13
             _comment = editedComment;
             _editDate = SystemClock.Now;
 
-            this.AddDomainEvent(new MeetingCommentEditedDomainEvent(this.Id, editedComment));
+            ;
         }
 

[Killed] Block removal mutation
MeetingComments/MeetingComment.cs:89:9
         }
 
         public void Remove(MemberId removingMemberId, MeetingGroup meetingGroup, string reason = null)
-        {
-            this.CheckRule(new MeetingCommentCanBeRemovedOnlyByAuthorOrGroupOrganizerRule(meetingGroup, this._authorId, removingMemberId));
-            this.CheckRule(new RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule(meetingGroup, removingMemberId, reason));
-
-            _isRemoved = true;
-            _removedByReason = reason ?? string.Empty;
-
-            this.AddDomainEvent(new MeetingCommentRemovedDomainEvent(this.Id));
-        }
+        {}
 
         public MeetingComment Reply(MemberId replierId, string reply, MeetingGroup meetingGroup, MeetingCommentingConfiguration meetingCommentingConfiguration)

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:90:13
 
         public void Remove(MemberId removingMemberId, MeetingGroup meetingGroup, string reason = null)
         {
-            this.CheckRule(new MeetingCommentCanBeRemovedOnlyByAuthorOrGroupOrganizerRule(meetingGroup, this._authorId, removingMemberId));
+            ;
             this.CheckRule(new RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule(meetingGroup, removingMemberId, reason));
 

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:91:13
         public void Remove(MemberId removingMemberId, MeetingGroup meetingGroup, string reason = null)
         {
             this.CheckRule(new MeetingCommentCanBeRemovedOnlyByAuthorOrGroupOrganizerRule(meetingGroup, this._authorId, removingMemberId));
-            this.CheckRule(new RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule(meetingGroup, removingMemberId, reason));
+            ;
 
             _isRemoved = true;

[Survived] Boolean mutation
MeetingComments/MeetingComment.cs:93:26
             this.CheckRule(new MeetingCommentCanBeRemovedOnlyByAuthorOrGroupOrganizerRule(meetingGroup, this._authorId, removingMemberId));
             this.CheckRule(new RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule(meetingGroup, removingMemberId, reason));
 
-            _isRemoved = true;
+            _isRemoved = false;
             _removedByReason = reason ?? string.Empty;
 

[Survived] String mutation
MeetingComments/MeetingComment.cs:94:42
             this.CheckRule(new RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule(meetingGroup, removingMemberId, reason));
 
             _isRemoved = true;
-            _removedByReason = reason ?? string.Empty;
+            _removedByReason = reason ?? "Stryker was here!";
 
             this.AddDomainEvent(new MeetingCommentRemovedDomainEvent(this.Id));

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:96:13
             _isRemoved = true;
             _removedByReason = reason ?? string.Empty;
 
-            this.AddDomainEvent(new MeetingCommentRemovedDomainEvent(this.Id));
+            ;
         }
 

[Killed] Block removal mutation
MeetingComments/MeetingComment.cs:112:9
             MemberId likerId,
             MeetingGroupMemberData likerMeetingGroupMember,
             int meetingMemberCommentLikesCount)
-        {
-            this.CheckRule(new CommentCanBeLikedOnlyByMeetingGroupMemberRule(likerMeetingGroupMember));
-            this.CheckRule(new CommentCannotBeLikedByTheSameMemberMoreThanOnceRule(meetingMemberCommentLikesCount));
-
-            return MeetingMemberCommentLike.Create(this.Id, likerId);
-        }
+        {}
 
         public MeetingId GetMeetingId() => this._meetingId;

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:113:13
             MeetingGroupMemberData likerMeetingGroupMember,
             int meetingMemberCommentLikesCount)
         {
-            this.CheckRule(new CommentCanBeLikedOnlyByMeetingGroupMemberRule(likerMeetingGroupMember));
+            ;
             this.CheckRule(new CommentCannotBeLikedByTheSameMemberMoreThanOnceRule(meetingMemberCommentLikesCount));
 

[Killed] Statement mutation
MeetingComments/MeetingComment.cs:114:13
             int meetingMemberCommentLikesCount)
         {
             this.CheckRule(new CommentCanBeLikedOnlyByMeetingGroupMemberRule(likerMeetingGroupMember));
-            this.CheckRule(new CommentCannotBeLikedByTheSameMemberMoreThanOnceRule(meetingMemberCommentLikesCount));
+            ;
 
             return MeetingMemberCommentLike.Create(this.Id, likerId);
