[Killed] Block removal mutation
MeetingComments/Rules/CommentCanBeAddedOnlyByMeetingGroupMemberRule.cs:13:9
         private readonly MeetingGroup _meetingGroup;
 
         public CommentCanBeAddedOnlyByMeetingGroupMemberRule(MemberId authorId, MeetingGroup meetingGroup)
-        {
-            _authorId = authorId;
-            _meetingGroup = meetingGroup;
-        }
+        {}
 
         public bool IsBroken() => !_meetingGroup.IsMemberOfGroup(_authorId);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingComments/Rules/CommentCanBeAddedOnlyByMeetingGroupMemberRule.cs:18:35
             _meetingGroup = meetingGroup;
         }
 
-        public bool IsBroken() => !_meetingGroup.IsMemberOfGroup(_authorId);
+        public bool IsBroken() => _meetingGroup.IsMemberOfGroup(_authorId);
 
         public string Message => "Only meeting attendee can add comments";

[Survived] String mutation
MeetingComments/Rules/CommentCanBeAddedOnlyByMeetingGroupMemberRule.cs:20:34
 
         public bool IsBroken() => !_meetingGroup.IsMemberOfGroup(_authorId);
 
-        public string Message => "Only meeting attendee can add comments";
+        public string Message => "";
     }
 }
