[Killed] Block removal mutation
MeetingComments/Rules/CommentCanBeCreatedOnlyIfCommentingForMeetingEnabledRule.cs:11:9
         private readonly MeetingCommentingConfiguration _meetingCommentingConfiguration;
 
         public CommentCanBeCreatedOnlyIfCommentingForMeetingEnabledRule(MeetingCommentingConfiguration meetingCommentingConfiguration)
-        {
-            _meetingCommentingConfiguration = meetingCommentingConfiguration;
-        }
+        {}
 
         public bool IsBroken() => !_meetingCommentingConfiguration.GetIsCommentingEnabled();

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingComments/Rules/CommentCanBeCreatedOnlyIfCommentingForMeetingEnabledRule.cs:15:35
             _meetingCommentingConfiguration = meetingCommentingConfiguration;
         }
 
-        public bool IsBroken() => !_meetingCommentingConfiguration.GetIsCommentingEnabled();
+        public bool IsBroken() => _meetingCommentingConfiguration.GetIsCommentingEnabled();
 
         public string Message => "Commenting for meeting is disabled.";
