[Killed] Block removal mutation
MeetingComments/Rules/CommentCanBeEditedOnlyIfCommentingForMeetingEnabledRule.cs:11:9
         private readonly MeetingCommentingConfiguration _meetingCommentingConfiguration;
 
         public CommentCanBeEditedOnlyIfCommentingForMeetingEnabledRule(MeetingCommentingConfiguration meetingCommentingConfiguration)
-        {
-            _meetingCommentingConfiguration = meetingCommentingConfiguration;
-        }
+        {}
 
         public bool IsBroken() => !_meetingCommentingConfiguration.GetIsCommentingEnabled();
