[Killed] Block removal mutation
MeetingComments/Rules/CommentCanBeLikedOnlyByMeetingGroupMemberRule.cs:11:9
         private readonly MeetingGroupMemberData _likerMeetingGroupMember;
 
         public CommentCanBeLikedOnlyByMeetingGroupMemberRule(MeetingGroupMemberData? likerMeetingGroupMember)
-        {
-            _likerMeetingGroupMember = likerMeetingGroupMember;
-        }
+        {}
 
         public bool IsBroken() => _likerMeetingGroupMember == null;

[Killed] Equality mutation
MeetingComments/Rules/CommentCanBeLikedOnlyByMeetingGroupMemberRule.cs:15:35
             _likerMeetingGroupMember = likerMeetingGroupMember;
         }
 
-        public bool IsBroken() => _likerMeetingGroupMember == null;
+        public bool IsBroken() => _likerMeetingGroupMember != null;
 
         public string Message => "Comment can be liked only by meeting group member.";

[Survived] String mutation
MeetingComments/Rules/CommentCanBeLikedOnlyByMeetingGroupMemberRule.cs:17:34
 
         public bool IsBroken() => _likerMeetingGroupMember == null;
 
-        public string Message => "Comment can be liked only by meeting group member.";
+        public string Message => "";
     }
 }
