[Killed] Block removal mutation
MeetingComments/Rules/CommentCannotBeLikedByTheSameMemberMoreThanOnceRule.cs:10:9
         private readonly int _memberCommentLikesCount;
 
         public CommentCannotBeLikedByTheSameMemberMoreThanOnceRule(int memberCommentLikesCount)
-        {
-            _memberCommentLikesCount = memberCommentLikesCount;
-        }
+        {}
 
         public bool IsBroken() => _memberCommentLikesCount > 0;

[Killed] Equality mutation
MeetingComments/Rules/CommentCannotBeLikedByTheSameMemberMoreThanOnceRule.cs:14:35
             _memberCommentLikesCount = memberCommentLikesCount;
         }
 
-        public bool IsBroken() => _memberCommentLikesCount > 0;
+        public bool IsBroken() => _memberCommentLikesCount >= 0;
 
         public string Message => "Member cannot like one comment more than once.";

[Killed] Equality mutation
MeetingComments/Rules/CommentCannotBeLikedByTheSameMemberMoreThanOnceRule.cs:14:35
             _memberCommentLikesCount = memberCommentLikesCount;
         }
 
-        public bool IsBroken() => _memberCommentLikesCount > 0;
+        public bool IsBroken() => _memberCommentLikesCount < 0;
 
         public string Message => "Member cannot like one comment more than once.";
