[Killed] Block removal mutation
MeetingComments/Rules/CommentTextMustBeProvidedRule.cs:10:9
         private readonly string _comment;
 
         public CommentTextMustBeProvidedRule(string comment)
-        {
-            _comment = comment;
-        }
+        {}
 
         public bool IsBroken() => string.IsNullOrEmpty(_comment);
