[Killed] Block removal mutation
MeetingComments/Rules/MeetingCommentCanBeEditedOnlyByAuthorRule.cs:12:9
         private readonly MemberId _editorId;
 
         public MeetingCommentCanBeEditedOnlyByAuthorRule(MemberId authorId, MemberId editorId)
-        {
-            _authorId = authorId;
-            _editorId = editorId;
-        }
+        {}
 
         public bool IsBroken() => _editorId != _authorId;

[Killed] Equality mutation
MeetingComments/Rules/MeetingCommentCanBeEditedOnlyByAuthorRule.cs:17:35
             _editorId = editorId;
         }
 
-        public bool IsBroken() => _editorId != _authorId;
+        public bool IsBroken() => _editorId == _authorId;
 
         public string Message => "Only the author of a comment can edit it.";
