[Killed] Block removal mutation
MeetingComments/Rules/MeetingCommentCanBeRemovedOnlyByAuthorOrGroupOrganizerRule.cs:14:9
         private readonly MemberId _removingMemberId;
 
         public MeetingCommentCanBeRemovedOnlyByAuthorOrGroupOrganizerRule(MeetingGroup meetingGroup, MemberId authorId, MemberId removingMemberId)
-        {
-            _meetingGroup = meetingGroup;
-            _authorId = authorId;
-            _removingMemberId = removingMemberId;
-        }
+        {}
 
         public bool IsBroken() => _removingMemberId != _authorId && !_meetingGroup.IsOrganizer(_removingMemberId);

[Killed] Logical mutation
MeetingComments/Rules/MeetingCommentCanBeRemovedOnlyByAuthorOrGroupOrganizerRule.cs:20:35
             _removingMemberId = removingMemberId;
         }
 
-        public bool IsBroken() => _removingMemberId != _authorId && !_meetingGroup.IsOrganizer(_removingMemberId);
+        public bool IsBroken() => _removingMemberId != _authorId || !_meetingGroup.IsOrganizer(_removingMemberId);
 
         public string Message => "Only author of comment or group organizer can remove meeting comment.";

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingComments/Rules/MeetingCommentCanBeRemovedOnlyByAuthorOrGroupOrganizerRule.cs:20:69
             _removingMemberId = removingMemberId;
         }
 
-        public bool IsBroken() => _removingMemberId != _authorId && !_meetingGroup.IsOrganizer(_removingMemberId);
+        public bool IsBroken() => _removingMemberId != _authorId && _meetingGroup.IsOrganizer(_removingMemberId);
 
         public string Message => "Only author of comment or group organizer can remove meeting comment.";
