[Killed] Block removal mutation
MeetingComments/Rules/RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule.cs:14:9
         private readonly string _removingReason;
 
         public RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule(MeetingGroup meetingGroup, MemberId removingMemberId, string removingReason)
-        {
-            _meetingGroup = meetingGroup;
-            _removingMemberId = removingMemberId;
-            _removingReason = removingReason;
-        }
+        {}
 
         public bool IsBroken() =>

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingComments/Rules/RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule.cs:21:13
         }
 
         public bool IsBroken() =>
-            !string.IsNullOrEmpty(_removingReason) && !_meetingGroup.IsOrganizer(_removingMemberId);
+            string.IsNullOrEmpty(_removingReason)  && !_meetingGroup.IsOrganizer(_removingMemberId);
 
         public string Message => "Only group organizer can provide comment's removing reason.";

[Killed] Logical mutation
MeetingComments/Rules/RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule.cs:21:13
         }
 
         public bool IsBroken() =>
-            !string.IsNullOrEmpty(_removingReason) && !_meetingGroup.IsOrganizer(_removingMemberId);
+                        !string.IsNullOrEmpty(_removingReason) || !_meetingGroup.IsOrganizer(_removingMemberId);
 
         public string Message => "Only group organizer can provide comment's removing reason.";

[Survived] String mutation
MeetingComments/Rules/RemovingReasonCanBeProvidedOnlyByGroupOrganizerRule.cs:23:34
         public bool IsBroken() =>
             !string.IsNullOrEmpty(_removingReason) && !_meetingGroup.IsOrganizer(_removingMemberId);
 
-        public string Message => "Only group organizer can provide comment's removing reason.";
+        public string Message => "";
     }
 }
