[Killed] Block removal mutation
MeetingGroupProposals/Events/MeetingGroupProposalAcceptedDomainEvent.cs:10:9
         public MeetingGroupProposalId MeetingGroupProposalId { get; }
 
         public MeetingGroupProposalAcceptedDomainEvent(MeetingGroupProposalId meetingGroupProposalId)
-        {
-            MeetingGroupProposalId = meetingGroupProposalId;
-        }
+        {}
     }
 }
