[Killed] Block removal mutation
MeetingGroupProposals/Events/MeetingGroupProposedDomainEvent.cs:17:9
             DateTime proposalDate,
             string locationCity,
             string locationCountryCode)
-        {
-            this.MeetingGroupProposalId = meetingGroupProposalId;
-            this.Name = name;
-            this.Description = description;
-            this.LocationCity = locationCity;
-            this.LocationCountryCode = locationCountryCode;
-            this.ProposalDate = proposalDate;
-            this.ProposalUserId = proposalUserId;
-        }
+        {}
 
         public MeetingGroupProposalId MeetingGroupProposalId { get; }
