[Killed] Block removal mutation
MeetingGroupProposals/MeetingGroupProposal.cs:28:9
         private MeetingGroupProposalStatus _status;
 
         public MeetingGroup CreateMeetingGroup()
-        {
-            return MeetingGroup.CreateBasedOnProposal(this.Id, _name, _description, _location, _proposalUserId);
-        }
+        {}
 
         private MeetingGroupProposal()

[Killed] Block removal mutation
MeetingGroupProposals/MeetingGroupProposal.cs:42:9
             string description,
             MeetingGroupLocation location,
             MemberId proposalUserId)
-        {
-            Id = new MeetingGroupProposalId(Guid.NewGuid());
-            _name = name;
-            _description = description;
-            _location = location;
-            _proposalUserId = proposalUserId;
-            _proposalDate = SystemClock.Now;
-            _status = MeetingGroupProposalStatus.InVerification;
-
-            this.AddDomainEvent(new MeetingGroupProposedDomainEvent(this.Id, _name, _description, proposalUserId, _proposalDate, _location.City, _location.CountryCode));
-        }
+        {}
 
         public static MeetingGroupProposal ProposeNew(

[Killed] Statement mutation
MeetingGroupProposals/MeetingGroupProposal.cs:51:13
             _proposalDate = SystemClock.Now;
             _status = MeetingGroupProposalStatus.InVerification;
 
-            this.AddDomainEvent(new MeetingGroupProposedDomainEvent(this.Id, _name, _description, proposalUserId, _proposalDate, _location.City, _location.CountryCode));
+            ;
         }
 

[Killed] Block removal mutation
MeetingGroupProposals/MeetingGroupProposal.cs:59:9
             string description,
             MeetingGroupLocation location,
             MemberId proposalMemberId)
-        {
-            return new MeetingGroupProposal(name, description, location, proposalMemberId);
-        }
+        {}
 
         public void Accept()

[Killed] Block removal mutation
MeetingGroupProposals/MeetingGroupProposal.cs:64:9
         }
 
         public void Accept()
-        {
-            this.CheckRule(new MeetingGroupProposalCannotBeAcceptedMoreThanOnceRule(_status));
-
-            _status = MeetingGroupProposalStatus.Accepted;
-
-            this.AddDomainEvent(new MeetingGroupProposalAcceptedDomainEvent(this.Id));
-        }
+        {}
     }
 }

[Killed] Statement mutation
MeetingGroupProposals/MeetingGroupProposal.cs:65:13
 
         public void Accept()
         {
-            this.CheckRule(new MeetingGroupProposalCannotBeAcceptedMoreThanOnceRule(_status));
+            ;
 
             _status = MeetingGroupProposalStatus.Accepted;

[Killed] Statement mutation
MeetingGroupProposals/MeetingGroupProposal.cs:69:13
 
             _status = MeetingGroupProposalStatus.Accepted;
 
-            this.AddDomainEvent(new MeetingGroupProposalAcceptedDomainEvent(this.Id));
+            ;
         }
     }
