[Survived] String mutation
MeetingGroupProposals/MeetingGroupProposalStatus.cs:10:101
     {
         public string Value { get; }
 
-        internal static MeetingGroupProposalStatus InVerification => new MeetingGroupProposalStatus("InVerification");
+        internal static MeetingGroupProposalStatus InVerification => new MeetingGroupProposalStatus("");
 
         internal static MeetingGroupProposalStatus Accepted => new MeetingGroupProposalStatus("Accepted");

[Killed] String mutation
MeetingGroupProposals/MeetingGroupProposalStatus.cs:12:95
 
         internal static MeetingGroupProposalStatus InVerification => new MeetingGroupProposalStatus("InVerification");
 
-        internal static MeetingGroupProposalStatus Accepted => new MeetingGroupProposalStatus("Accepted");
+        internal static MeetingGroupProposalStatus Accepted => new MeetingGroupProposalStatus("");
 
         internal bool IsAccepted => Value == "Accepted";

[Killed] Equality mutation
MeetingGroupProposals/MeetingGroupProposalStatus.cs:14:37
 
         internal static MeetingGroupProposalStatus Accepted => new MeetingGroupProposalStatus("Accepted");
 
-        internal bool IsAccepted => Value == "Accepted";
+        internal bool IsAccepted => Value != "Accepted";
 
         private MeetingGroupProposalStatus(string value)

[Killed] Block removal mutation
MeetingGroupProposals/MeetingGroupProposalStatus.cs:17:9
         internal bool IsAccepted => Value == "Accepted";
 
         private MeetingGroupProposalStatus(string value)
-        {
-            Value = value;
-        }
+        {}
     }
 }
