[Killed] Block removal mutation
MeetingGroupProposals/Rules/MeetingGroupProposalCannotBeAcceptedMoreThanOnceRule.cs:10:9
         private readonly MeetingGroupProposalStatus _actualStatus;
 
         internal MeetingGroupProposalCannotBeAcceptedMoreThanOnceRule(MeetingGroupProposalStatus actualStatus)
-        {
-            _actualStatus = actualStatus;
-        }
+        {}
 
         public bool IsBroken() => _actualStatus.IsAccepted;
