[Killed] Block removal mutation
MeetingGroups/Events/MeetingAttendeeChangedDecisionDomainEvent.cs:10:9
     public class MeetingAttendeeChangedDecisionDomainEvent : DomainEventBase
     {
         public MeetingAttendeeChangedDecisionDomainEvent(MemberId memberId, MeetingId meetingId)
-        {
-            MemberId = memberId;
-            MeetingId = meetingId;
-        }
+        {}
 
         public MemberId MemberId { get; }
