[Killed] Block removal mutation
MeetingGroups/Events/MeetingGroupCreatedDomainEvent.cs:13:9
         public MemberId CreatorId { get; }
 
         public MeetingGroupCreatedDomainEvent(MeetingGroupId meetingGroupId, MemberId creatorId)
-        {
-            this.MeetingGroupId = meetingGroupId;
-            this.CreatorId = creatorId;
-        }
+        {}
     }
 }
