[Killed] Block removal mutation
MeetingGroups/Events/MeetingGroupGeneralAttributesEditedDomainEvent.cs:14:9
         public MeetingGroupLocation NewLocation { get; }
 
         public MeetingGroupGeneralAttributesEditedDomainEvent(string newName, string newDescription, MeetingGroupLocation newLocation)
-        {
-            this.NewName = newName;
-            this.NewDescription = newDescription;
-            this.NewLocation = newLocation;
-        }
+        {}
     }
 }
