[Killed] Block removal mutation
MeetingGroups/Events/MeetingGroupMemberLeftGroupDomainEvent.cs:9:9
     public class MeetingGroupMemberLeftGroupDomainEvent : DomainEventBase
     {
         public MeetingGroupMemberLeftGroupDomainEvent(MeetingGroupId meetingGroupId, MemberId memberId)
-        {
-            MeetingGroupId = meetingGroupId;
-            MemberId = memberId;
-        }
+        {}
 
         public MeetingGroupId MeetingGroupId { get; }
