[Killed] Block removal mutation
MeetingGroups/Events/MeetingGroupPaymentInfoUpdatedDomainEvent.cs:9:9
     public class MeetingGroupPaymentInfoUpdatedDomainEvent : DomainEventBase
     {
         public MeetingGroupPaymentInfoUpdatedDomainEvent(MeetingGroupId meetingGroupId, DateTime paymentDateTo)
-        {
-            MeetingGroupId = meetingGroupId;
-            PaymentDateTo = paymentDateTo;
-        }
+        {}
 
         public MeetingGroupId MeetingGroupId { get; }
