[Killed] Block removal mutation
MeetingGroups/Events/MeetingNotAttendeeChangedDecisionDomainEvent.cs:10:9
     public class MeetingNotAttendeeChangedDecisionDomainEvent : DomainEventBase
     {
         public MeetingNotAttendeeChangedDecisionDomainEvent(MemberId memberId, MeetingId meetingId)
-        {
-            MemberId = memberId;
-            MeetingId = meetingId;
-        }
+        {}
 
         public MemberId MemberId { get; }
