[Killed] Block removal mutation
MeetingGroups/Events/NewMeetingGroupMemberJoinedDomainEvent.cs:15:9
         public MeetingGroupMemberRole Role { get; }
 
         public NewMeetingGroupMemberJoinedDomainEvent(MeetingGroupId meetingGroupId, MemberId memberId, MeetingGroupMemberRole role)
-        {
-            this.MeetingGroupId = meetingGroupId;
-            this.MemberId = memberId;
-            this.Role = role;
-        }
+        {}
     }
 }
