[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:40:9
             string description,
             MeetingGroupLocation location,
             MemberId creatorId)
-        {
-            return new MeetingGroup(meetingGroupProposalId, name, description, location, creatorId);
-        }
+        {}
 
         private MeetingGroup()

[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:50:9
         }
 
         private MeetingGroup(MeetingGroupProposalId meetingGroupProposalId, string name, string description, MeetingGroupLocation location, MemberId creatorId)
-        {
-            this.Id = new MeetingGroupId(meetingGroupProposalId.Value);
-            this._name = name;
-            this._description = description;
-            this._creatorId = creatorId;
-            this._location = location;
-            this._createDate = SystemClock.Now;
-
-            this.AddDomainEvent(new MeetingGroupCreatedDomainEvent(this.Id, creatorId));
-
-            this._members = new List<MeetingGroupMember>();
-            this._members.Add(MeetingGroupMember.CreateNew(this.Id, this._creatorId, MeetingGroupMemberRole.Organizer));
-        }
+        {}
 
         public void EditGeneralAttributes(string name, string description, MeetingGroupLocation location)

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:58:13
             this._location = location;
             this._createDate = SystemClock.Now;
 
-            this.AddDomainEvent(new MeetingGroupCreatedDomainEvent(this.Id, creatorId));
+            ;
 
             this._members = new List<MeetingGroupMember>();

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:61:13
             this.AddDomainEvent(new MeetingGroupCreatedDomainEvent(this.Id, creatorId));
 
             this._members = new List<MeetingGroupMember>();
-            this._members.Add(MeetingGroupMember.CreateNew(this.Id, this._creatorId, MeetingGroupMemberRole.Organizer));
+            ;
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:65:9
         }
 
         public void EditGeneralAttributes(string name, string description, MeetingGroupLocation location)
-        {
-            this._name = name;
-            this._description = description;
-            this._location = location;
-
-            this.AddDomainEvent(new MeetingGroupGeneralAttributesEditedDomainEvent(this._name, this._description, this._location));
-        }
+        {}
 
         public void JoinToGroupMember(MemberId memberId)

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:70:13
             this._description = description;
             this._location = location;
 
-            this.AddDomainEvent(new MeetingGroupGeneralAttributesEditedDomainEvent(this._name, this._description, this._location));
+            ;
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:74:9
         }
 
         public void JoinToGroupMember(MemberId memberId)
-        {
-            this.CheckRule(new MeetingGroupMemberCannotBeAddedTwiceRule(_members, memberId));
-
-            this._members.Add(MeetingGroupMember.CreateNew(this.Id, memberId, MeetingGroupMemberRole.Member));
-        }
+        {}
 
         public void LeaveGroup(MemberId memberId)

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:75:13
 
         public void JoinToGroupMember(MemberId memberId)
         {
-            this.CheckRule(new MeetingGroupMemberCannotBeAddedTwiceRule(_members, memberId));
+            ;
 
             this._members.Add(MeetingGroupMember.CreateNew(this.Id, memberId, MeetingGroupMemberRole.Member));

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:77:13
         {
             this.CheckRule(new MeetingGroupMemberCannotBeAddedTwiceRule(_members, memberId));
 
-            this._members.Add(MeetingGroupMember.CreateNew(this.Id, memberId, MeetingGroupMemberRole.Member));
+            ;
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:81:9
         }
 
         public void LeaveGroup(MemberId memberId)
-        {
-            this.CheckRule(new NotActualGroupMemberCannotLeaveGroupRule(_members, memberId));
-
-            var member = this._members.Single(x => x.IsMember(memberId));
-
-            member.Leave();
-        }
+        {}
 
         public void SetExpirationDate(DateTime dateTo)

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:82:13
 
         public void LeaveGroup(MemberId memberId)
         {
-            this.CheckRule(new NotActualGroupMemberCannotLeaveGroupRule(_members, memberId));
+            ;
 
             var member = this._members.Single(x => x.IsMember(memberId));

[Survived] Linq method mutation (Single() to SingleOrDefault())
MeetingGroups/MeetingGroup.cs:84:26
         {
             this.CheckRule(new NotActualGroupMemberCannotLeaveGroupRule(_members, memberId));
 
-            var member = this._members.Single(x => x.IsMember(memberId));
+            var member = this._members.SingleOrDefault(x => x.IsMember(memberId));
 
             member.Leave();

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:86:13
 
             var member = this._members.Single(x => x.IsMember(memberId));
 
-            member.Leave();
+            ;
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:90:9
         }
 
         public void SetExpirationDate(DateTime dateTo)
-        {
-            _paymentDateTo = dateTo;
-
-            this.AddDomainEvent(new MeetingGroupPaymentInfoUpdatedDomainEvent(this.Id, _paymentDateTo.Value));
-        }
+        {}
 
         public Meeting CreateMeeting(

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:93:13
         {
             _paymentDateTo = dateTo;
 
-            this.AddDomainEvent(new MeetingGroupPaymentInfoUpdatedDomainEvent(this.Id, _paymentDateTo.Value));
+            ;
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:107:9
             MoneyValue eventFee,
             List<MemberId> hostsMembersIds,
             MemberId creatorId)
-        {
-            this.CheckRule(new MeetingCanBeOrganizedOnlyByPayedGroupRule(_paymentDateTo));
-
-            this.CheckRule(new MeetingHostMustBeAMeetingGroupMemberRule(creatorId, hostsMembersIds, _members));
-
-            return Meeting.CreateNew(
-                this.Id,
-                title,
-                term,
-                description,
-                location,
-                MeetingLimits.Create(attendeesLimit, guestsLimit),
-                rsvpTerm,
-                eventFee,
-                hostsMembersIds,
-                creatorId);
-        }
+        {}
 
         internal bool IsMemberOfGroup(MemberId attendeeId)

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:108:13
             List<MemberId> hostsMembersIds,
             MemberId creatorId)
         {
-            this.CheckRule(new MeetingCanBeOrganizedOnlyByPayedGroupRule(_paymentDateTo));
+            ;
 
             this.CheckRule(new MeetingHostMustBeAMeetingGroupMemberRule(creatorId, hostsMembersIds, _members));

[Killed] Statement mutation
MeetingGroups/MeetingGroup.cs:110:13
         {
             this.CheckRule(new MeetingCanBeOrganizedOnlyByPayedGroupRule(_paymentDateTo));
 
-            this.CheckRule(new MeetingHostMustBeAMeetingGroupMemberRule(creatorId, hostsMembersIds, _members));
+            ;
 
             return Meeting.CreateNew(

[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:126:9
         }
 
         internal bool IsMemberOfGroup(MemberId attendeeId)
-        {
-            return _members.Any(x => x.IsMember(attendeeId));
-        }
+        {}
 
         internal bool IsOrganizer(MemberId memberId)

[Killed] Linq method mutation (Any() to All())
MeetingGroups/MeetingGroup.cs:127:20
 
         internal bool IsMemberOfGroup(MemberId attendeeId)
         {
-            return _members.Any(x => x.IsMember(attendeeId));
+            return _members.All(x => x.IsMember(attendeeId));
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroup.cs:131:9
         }
 
         internal bool IsOrganizer(MemberId memberId)
-        {
-            return _members.Any(x => x.IsOrganizer(memberId));
-        }
+        {}
     }
 }

[Killed] Linq method mutation (Any() to All())
MeetingGroups/MeetingGroup.cs:132:20
 
         internal bool IsOrganizer(MemberId memberId)
         {
-            return _members.Any(x => x.IsOrganizer(memberId));
+            return _members.All(x => x.IsOrganizer(memberId));
         }
     }
