[Killed] Block removal mutation
MeetingGroups/MeetingGroupLocation.cs:8:9
     public class MeetingGroupLocation : ValueObject
     {
         public static MeetingGroupLocation CreateNew(string city, string countryCode)
-        {
-            return new MeetingGroupLocation(city, countryCode);
-        }
+        {}
 
         public string City { get; }

[Survived] Block removal mutation
MeetingGroups/MeetingGroupLocation.cs:17:9
         public string CountryCode { get; }
 
         private MeetingGroupLocation(string city, string countryCode)
-        {
-            City = city;
-            CountryCode = countryCode;
-        }
+        {}
     }
 }
