[Killed] Block removal mutation
MeetingGroups/MeetingGroupMember.cs:32:9
             MeetingGroupId meetingGroupId,
             MemberId memberId,
             MeetingGroupMemberRole role)
-        {
-            this.MeetingGroupId = meetingGroupId;
-            this.MemberId = memberId;
-            this._role = role;
-            this.JoinedDate = SystemClock.Now;
-            this._isActive = true;
-
-            this.AddDomainEvent(new NewMeetingGroupMemberJoinedDomainEvent(this.MeetingGroupId, this.MemberId, this._role));
-        }
+        {}
 
         internal static MeetingGroupMember CreateNew(

[Killed] Boolean mutation
MeetingGroups/MeetingGroupMember.cs:37:30
             this.MemberId = memberId;
             this._role = role;
             this.JoinedDate = SystemClock.Now;
-            this._isActive = true;
+            this._isActive = false;
 
             this.AddDomainEvent(new NewMeetingGroupMemberJoinedDomainEvent(this.MeetingGroupId, this.MemberId, this._role));

[Killed] Statement mutation
MeetingGroups/MeetingGroupMember.cs:39:13
             this.JoinedDate = SystemClock.Now;
             this._isActive = true;
 
-            this.AddDomainEvent(new NewMeetingGroupMemberJoinedDomainEvent(this.MeetingGroupId, this.MemberId, this._role));
+            ;
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroupMember.cs:46:9
             MeetingGroupId meetingGroupId,
             MemberId memberId,
             MeetingGroupMemberRole role)
-        {
-            return new MeetingGroupMember(meetingGroupId, memberId, role);
-        }
+        {}
 
         internal void Leave()

[Killed] Block removal mutation
MeetingGroups/MeetingGroupMember.cs:51:9
         }
 
         internal void Leave()
-        {
-            _isActive = false;
-            _leaveDate = SystemClock.Now;
-
-            this.AddDomainEvent(new MeetingGroupMemberLeftGroupDomainEvent(this.MeetingGroupId, this.MemberId));
-        }
+        {}
 
         internal bool IsMember(MemberId memberId)

[Survived] Boolean mutation
MeetingGroups/MeetingGroupMember.cs:52:25
 
         internal void Leave()
         {
-            _isActive = false;
+            _isActive = true;
             _leaveDate = SystemClock.Now;
 

[Killed] Statement mutation
MeetingGroups/MeetingGroupMember.cs:55:13
             _isActive = false;
             _leaveDate = SystemClock.Now;
 
-            this.AddDomainEvent(new MeetingGroupMemberLeftGroupDomainEvent(this.MeetingGroupId, this.MemberId));
+            ;
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroupMember.cs:59:9
         }
 
         internal bool IsMember(MemberId memberId)
-        {
-            return this._isActive && this.MemberId == memberId;
-        }
+        {}
 
         internal bool IsOrganizer(MemberId memberId)

[Killed] Logical mutation
MeetingGroups/MeetingGroupMember.cs:60:20
 
         internal bool IsMember(MemberId memberId)
         {
-            return this._isActive && this.MemberId == memberId;
+            return this._isActive || this.MemberId == memberId;
         }
 

[Killed] Equality mutation
MeetingGroups/MeetingGroupMember.cs:60:38
 
         internal bool IsMember(MemberId memberId)
         {
-            return this._isActive && this.MemberId == memberId;
+            return this._isActive && this.MemberId != memberId;
         }
 

[Killed] Block removal mutation
MeetingGroups/MeetingGroupMember.cs:64:9
         }
 
         internal bool IsOrganizer(MemberId memberId)
-        {
-            return this.IsMember(memberId) && _role == MeetingGroupMemberRole.Organizer;
-        }
+        {}
     }
 }

[Killed] Logical mutation
MeetingGroups/MeetingGroupMember.cs:65:20
 
         internal bool IsOrganizer(MemberId memberId)
         {
-            return this.IsMember(memberId) && _role == MeetingGroupMemberRole.Organizer;
+            return this.IsMember(memberId) || _role == MeetingGroupMemberRole.Organizer;
         }
     }

[Killed] Equality mutation
MeetingGroups/MeetingGroupMember.cs:65:47
 
         internal bool IsOrganizer(MemberId memberId)
         {
-            return this.IsMember(memberId) && _role == MeetingGroupMemberRole.Organizer;
+            return this.IsMember(memberId) && _role != MeetingGroupMemberRole.Organizer;
         }
     }
