[Survived] String mutation
MeetingGroups/MeetingGroupMemberRole.cs:9:83
     {
         public static MeetingGroupMemberRole Organizer => new MeetingGroupMemberRole("Organizer");
 
-        public static MeetingGroupMemberRole Member => new MeetingGroupMemberRole("Member");
+        public static MeetingGroupMemberRole Member => new MeetingGroupMemberRole("");
 
         public string Value { get; }

[Killed] Block removal mutation
MeetingGroups/MeetingGroupMemberRole.cs:14:9
         public string Value { get; }
 
         private MeetingGroupMemberRole(string value)
-        {
-            this.Value = value;
-        }
+        {}
 
         public static MeetingGroupMemberRole Of(string roleCode)

[NoCoverage] Block removal mutation
MeetingGroups/MeetingGroupMemberRole.cs:19:9
         }
 
         public static MeetingGroupMemberRole Of(string roleCode)
-        {
-            return new MeetingGroupMemberRole(roleCode);
-        }
+        {}
     }
 }
