[NoCoverage] Block removal mutation
MeetingGroups/Policies/MeetingGroupExpirationDatePolicy.cs:10:9
     {
         public static List<MeetingGroupId> GetMeetingGroupsCoveredByMemberSubscription(
             List<MeetingGroupMemberData> meetingGroups)
-        {
-            return meetingGroups
-                .Where(x => x.Role == MeetingGroupMemberRole.Organizer)
-                .Select(x => x.MeetingGroupId)
-                .ToList();
-        }
+        {}
     }
 }

[NoCoverage] Equality mutation
MeetingGroups/Policies/MeetingGroupExpirationDatePolicy.cs:12:29
             List<MeetingGroupMemberData> meetingGroups)
         {
             return meetingGroups
-                .Where(x => x.Role == MeetingGroupMemberRole.Organizer)
+                .Where(x => x.Role != MeetingGroupMemberRole.Organizer)
                 .Select(x => x.MeetingGroupId)
                 .ToList();
