[NoCoverage] Block removal mutation
MeetingGroups/Policies/MeetingGroupMemberData.cs:6:9
     public class MeetingGroupMemberData
     {
         public MeetingGroupMemberData(MeetingGroupId meetingGroupId, MeetingGroupMemberRole role)
-        {
-            MeetingGroupId = meetingGroupId;
-            Role = role;
-        }
+        {}
 
         public MeetingGroupId MeetingGroupId { get; }
