[Killed] Block removal mutation
MeetingGroups/Rules/MeetingCanBeOrganizedOnlyByPayedGroupRule.cs:12:9
         private readonly DateTime? _paymentDateTo;
 
         internal MeetingCanBeOrganizedOnlyByPayedGroupRule(DateTime? paymentDateTo)
-        {
-            _paymentDateTo = paymentDateTo;
-        }
+        {}
 
         public bool IsBroken() => !_paymentDateTo.HasValue || _paymentDateTo < SystemClock.Now;

[Killed] Logical mutation
MeetingGroups/Rules/MeetingCanBeOrganizedOnlyByPayedGroupRule.cs:16:35
             _paymentDateTo = paymentDateTo;
         }
 
-        public bool IsBroken() => !_paymentDateTo.HasValue || _paymentDateTo < SystemClock.Now;
+        public bool IsBroken() => !_paymentDateTo.HasValue && _paymentDateTo < SystemClock.Now;
 
         public string Message => "Meeting can be organized only by payed group";

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingGroups/Rules/MeetingCanBeOrganizedOnlyByPayedGroupRule.cs:16:35
             _paymentDateTo = paymentDateTo;
         }
 
-        public bool IsBroken() => !_paymentDateTo.HasValue || _paymentDateTo < SystemClock.Now;
+        public bool IsBroken() => _paymentDateTo.HasValue  || _paymentDateTo < SystemClock.Now;
 
         public string Message => "Meeting can be organized only by payed group";
