[Killed] Block removal mutation
MeetingGroups/Rules/MeetingGroupMemberCannotBeAddedTwiceRule.cs:16:9
 
         public MeetingGroupMemberCannotBeAddedTwiceRule(List<MeetingGroupMember> members, MemberId memberId)
             : base()
-        {
-            _members = members;
-            _memberId = memberId;
-        }
+        {}
 
         public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(_memberId)) != null;

[Killed] Linq method mutation (SingleOrDefault() to Single())
MeetingGroups/Rules/MeetingGroupMemberCannotBeAddedTwiceRule.cs:21:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(_memberId)) != null;
+        public bool IsBroken() => this._members.Single(x => x.IsMember(_memberId))  != null;
 
         public string Message => "Member cannot be added twice to the same group";

[Killed] Equality mutation
MeetingGroups/Rules/MeetingGroupMemberCannotBeAddedTwiceRule.cs:21:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(_memberId)) != null;
+        public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(_memberId)) == null;
 
         public string Message => "Member cannot be added twice to the same group";

[Survived] String mutation
MeetingGroups/Rules/MeetingGroupMemberCannotBeAddedTwiceRule.cs:23:34
 
         public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(_memberId)) != null;
 
-        public string Message => "Member cannot be added twice to the same group";
+        public string Message => "";
     }
 }
