[Killed] Block removal mutation
MeetingGroups/Rules/MeetingHostMustBeAMeetingGroupMemberRule.cs:20:9
             MemberId creatorId,
             List<MemberId> hostsMembersIds,
             List<MeetingGroupMember> members)
-        {
-            _creatorId = creatorId;
-            _hostsMembersIds = hostsMembersIds;
-            _members = members;
-        }
+        {}
 
         public bool IsBroken()

[Killed] Block removal mutation
MeetingGroups/Rules/MeetingHostMustBeAMeetingGroupMemberRule.cs:27:9
         }
 
         public bool IsBroken()
-        {
-            var memberIds = _members.Select(x => x.MemberId).ToList();
-            if (!_hostsMembersIds.Any() && !memberIds.Contains(_creatorId))
-            {
-                return true;
-            }
-
-            return _hostsMembersIds.Any() && _hostsMembersIds.Except(memberIds).Any();
-        }
+        {}
 
         public string Message => "Meeting host must be a meeting group member";

[Killed] Logical mutation
MeetingGroups/Rules/MeetingHostMustBeAMeetingGroupMemberRule.cs:29:17
         public bool IsBroken()
         {
             var memberIds = _members.Select(x => x.MemberId).ToList();
-            if (!_hostsMembersIds.Any() && !memberIds.Contains(_creatorId))
+            if (!_hostsMembersIds.Any() || !memberIds.Contains(_creatorId))
             {
                 return true;

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MeetingGroups/Rules/MeetingHostMustBeAMeetingGroupMemberRule.cs:29:44
         public bool IsBroken()
         {
             var memberIds = _members.Select(x => x.MemberId).ToList();
-            if (!_hostsMembersIds.Any() && !memberIds.Contains(_creatorId))
+            if (!_hostsMembersIds.Any() && memberIds.Contains(_creatorId))
             {
                 return true;

[Killed] Block removal mutation
MeetingGroups/Rules/MeetingHostMustBeAMeetingGroupMemberRule.cs:30:13
         {
             var memberIds = _members.Select(x => x.MemberId).ToList();
             if (!_hostsMembersIds.Any() && !memberIds.Contains(_creatorId))
-            {
-                return true;
-            }
+            {}
 
             return _hostsMembersIds.Any() && _hostsMembersIds.Except(memberIds).Any();

[Killed] Logical mutation
MeetingGroups/Rules/MeetingHostMustBeAMeetingGroupMemberRule.cs:34:20
                 return true;
             }
 
-            return _hostsMembersIds.Any() && _hostsMembersIds.Except(memberIds).Any();
+            return _hostsMembersIds.Any() || _hostsMembersIds.Except(memberIds).Any();
         }
 

[Survived] String mutation
MeetingGroups/Rules/MeetingHostMustBeAMeetingGroupMemberRule.cs:37:34
             return _hostsMembersIds.Any() && _hostsMembersIds.Except(memberIds).Any();
         }
 
-        public string Message => "Meeting host must be a meeting group member";
+        public string Message => "";
     }
 }
