[Killed] Block removal mutation
MeetingGroups/Rules/NotActualGroupMemberCannotLeaveGroupRule.cs:16:9
 
         public NotActualGroupMemberCannotLeaveGroupRule(List<MeetingGroupMember> members, MemberId memberId)
             : base()
-        {
-            _members = members;
-            this.memberId = memberId;
-        }
+        {}
 
         public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(memberId)) == null;

[Killed] Equality mutation
MeetingGroups/Rules/NotActualGroupMemberCannotLeaveGroupRule.cs:21:35
             this.memberId = memberId;
         }
 
-        public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(memberId)) == null;
+        public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(memberId)) != null;
 
         public string Message => "Member is not member of this group so he cannot leave it";

[Killed] Linq method mutation (SingleOrDefault() to Single())
MeetingGroups/Rules/NotActualGroupMemberCannotLeaveGroupRule.cs:21:35
             this.memberId = memberId;
         }
 
-        public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(memberId)) == null;
+        public bool IsBroken() => this._members.Single(x => x.IsMember(memberId))  == null;
 
         public string Message => "Member is not member of this group so he cannot leave it";

[Survived] String mutation
MeetingGroups/Rules/NotActualGroupMemberCannotLeaveGroupRule.cs:23:34
 
         public bool IsBroken() => this._members.SingleOrDefault(x => x.IsMember(memberId)) == null;
 
-        public string Message => "Member is not member of this group so he cannot leave it";
+        public string Message => "";
     }
 }
