[Killed] Block removal mutation
MeetingMemberCommentLikes/Events/MeetingCommentUnlikedDomainEvent.cs:14:9
         public MemberId LikerId { get; }
 
         public MeetingCommentUnlikedDomainEvent(MeetingCommentId meetingCommentId, MemberId likerId)
-        {
-            MeetingCommentId = meetingCommentId;
-            LikerId = likerId;
-        }
+        {}
     }
 }
