[Killed] Block removal mutation
MeetingMemberCommentLikes/MeetingMemberCommentLike.cs:23:9
         }
 
         private MeetingMemberCommentLike(MeetingCommentId meetingCommentId, MemberId memberId)
-        {
-            Id = new MeetingMemberCommentLikeId(Guid.NewGuid());
-            _meetingCommentId = meetingCommentId;
-            _memberId = memberId;
-
-            this.AddDomainEvent(new MeetingCommentLikedDomainEvent(meetingCommentId, memberId));
-        }
+        {}
 
         public void Remove()

[Killed] Statement mutation
MeetingMemberCommentLikes/MeetingMemberCommentLike.cs:28:13
             _meetingCommentId = meetingCommentId;
             _memberId = memberId;
 
-            this.AddDomainEvent(new MeetingCommentLikedDomainEvent(meetingCommentId, memberId));
+            ;
         }
 

[Killed] Block removal mutation
MeetingMemberCommentLikes/MeetingMemberCommentLike.cs:32:9
         }
 
         public void Remove()
-        {
-            this.AddDomainEvent(new MeetingCommentUnlikedDomainEvent(_meetingCommentId, _memberId));
-        }
+        {}
 
         public static MeetingMemberCommentLike Create(MeetingCommentId meetingCommentId, MemberId memberId)

[Killed] Statement mutation
MeetingMemberCommentLikes/MeetingMemberCommentLike.cs:33:13
 
         public void Remove()
         {
-            this.AddDomainEvent(new MeetingCommentUnlikedDomainEvent(_meetingCommentId, _memberId));
+            ;
         }
 
