[Killed] Block removal mutation
Meetings/Events/MeetingAttendeeAddedDomainEvent.cs:17:9
             int guestsNumber,
             decimal? feeValue,
             string feeCurrency)
-        {
-            MeetingId = meetingId;
-            AttendeeId = attendeeId;
-            RSVPDate = rsvpDate;
-            Role = role;
-            GuestsNumber = guestsNumber;
-            FeeValue = feeValue;
-            FeeCurrency = feeCurrency;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
