[NoCoverage] Block removal mutation
Meetings/Events/MeetingAttendeeFeePaidDomainEvent.cs:10:9
     public class MeetingAttendeeFeePaidDomainEvent : DomainEventBase
     {
         public MeetingAttendeeFeePaidDomainEvent(MeetingId meetingId, MemberId attendeeId)
-        {
-            MeetingId = meetingId;
-            AttendeeId = attendeeId;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
