[Killed] Block removal mutation
Meetings/Events/MeetingAttendeeRemovedDomainEvent.cs:10:9
     public class MeetingAttendeeRemovedDomainEvent : DomainEventBase
     {
         public MeetingAttendeeRemovedDomainEvent(MemberId memberId, MeetingId meetingId, string reason)
-        {
-            MemberId = memberId;
-            MeetingId = meetingId;
-            Reason = reason;
-        }
+        {}
 
         public MemberId MemberId { get; }
