[Killed] Block removal mutation
Meetings/Events/MeetingCanceledDomainEvent.cs:10:9
     public class MeetingCanceledDomainEvent : DomainEventBase
     {
         public MeetingCanceledDomainEvent(MeetingId meetingId, MemberId cancelMemberId, DateTime cancelDate)
-        {
-            MeetingId = meetingId;
-            CancelMemberId = cancelMemberId;
-            CancelDate = cancelDate;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
