[Survived] Block removal mutation
Meetings/Events/MeetingCreatedDomainEvent.cs:8:9
     public class MeetingCreatedDomainEvent : DomainEventBase
     {
         public MeetingCreatedDomainEvent(MeetingId meetingId)
-        {
-            MeetingId = meetingId;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
