[NoCoverage] Block removal mutation
Meetings/Events/MeetingEditedDomainEvent.cs:9:9
     public class MeetingEditedDomainEvent : DomainEventBase
     {
         public MeetingEditedDomainEvent(Guid meetingId)
-        {
-            MeetingId = meetingId;
-        }
+        {}
 
         public Guid MeetingId { get; }
