[NoCoverage] Block removal mutation
Meetings/Events/MeetingMainAttributesChangedDomainEvent.cs:8:9
     public class MeetingMainAttributesChangedDomainEvent : DomainEventBase
     {
         public MeetingMainAttributesChangedDomainEvent(MeetingId meetingId)
-        {
-            MeetingId = meetingId;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
