[Killed] Block removal mutation
Meetings/Events/MeetingNotAttendeeAddedDomainEvent.cs:13:9
         public MemberId MemberId { get; }
 
         public MeetingNotAttendeeAddedDomainEvent(MeetingId meetingId, MemberId memberId)
-        {
-            MeetingId = meetingId;
-            MemberId = memberId;
-        }
+        {}
     }
 }
