[Killed] Block removal mutation
Meetings/Events/MeetingWaitlistMemberAddedDomainEvent.cs:9:9
     public class MeetingWaitlistMemberAddedDomainEvent : DomainEventBase
     {
         public MeetingWaitlistMemberAddedDomainEvent(MeetingId meetingId, MemberId memberId)
-        {
-            MeetingId = meetingId;
-            MemberId = memberId;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
