[Killed] Block removal mutation
Meetings/Events/MemberSetAsAttendeeDomainEvent.cs:9:9
     public class MemberSetAsAttendeeDomainEvent : DomainEventBase
     {
         public MemberSetAsAttendeeDomainEvent(MeetingId meetingId, MemberId hostId)
-        {
-            MeetingId = meetingId;
-            HostId = hostId;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
