[Killed] Block removal mutation
Meetings/Events/MemberSignedOffFromMeetingWaitlistDomainEvent.cs:9:9
     public class MemberSignedOffFromMeetingWaitlistDomainEvent : DomainEventBase
     {
         public MemberSignedOffFromMeetingWaitlistDomainEvent(MeetingId meetingId, MemberId memberId)
-        {
-            MeetingId = meetingId;
-            MemberId = memberId;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
