[Killed] Block removal mutation
Meetings/Events/NewMeetingHostSetDomainEvent.cs:9:9
     public class NewMeetingHostSetDomainEvent : DomainEventBase
     {
         public NewMeetingHostSetDomainEvent(MeetingId meetingId, MemberId hostId)
-        {
-            MeetingId = meetingId;
-            HostId = hostId;
-        }
+        {}
 
         public MeetingId MeetingId { get; }
