[NoCoverage] Block removal mutation
Meetings/Meeting.cs:56:9
         private bool _isCanceled;
 
         private Meeting()
-        {
-            _attendees = new List<MeetingAttendee>();
-            _notAttendees = new List<MeetingNotAttendee>();
-            _waitlistMembers = new List<MeetingWaitlistMember>();
-        }
+        {}
 
         internal static Meeting CreateNew(

[Killed] Block removal mutation
Meetings/Meeting.cs:73:9
             MoneyValue eventFee,
             List<MemberId> hostsMembersIds,
             MemberId creatorId)
-        {
-            return new Meeting(
-                meetingGroupId,
-                title,
-                term,
-                description,
-                location,
-                meetingLimits,
-                rsvpTerm,
-                eventFee,
-                hostsMembersIds,
-                creatorId);
-        }
+        {}
 
         private Meeting(

[Killed] Statement mutation
Meetings/Meeting.cs:107:13
             _location = location;
             _meetingLimits = meetingLimits;
 
-            this.SetRsvpTerm(rsvpTerm, _term);
+            ;
             _eventFee = eventFee;
             _creatorId = creatorId;

[Killed] Statement mutation
Meetings/Meeting.cs:116:13
             _notAttendees = new List<MeetingNotAttendee>();
             _waitlistMembers = new List<MeetingWaitlistMember>();
 
-            this.AddDomainEvent(new MeetingCreatedDomainEvent(this.Id));
+            ;
             var rsvpDate = SystemClock.Now;
             if (hostsMembersIds.Any())

[Killed] Negate expression
Meetings/Meeting.cs:118:17
 
             this.AddDomainEvent(new MeetingCreatedDomainEvent(this.Id));
             var rsvpDate = SystemClock.Now;
-            if (hostsMembersIds.Any())
+            if (!(hostsMembersIds.Any()))
             {
                 foreach (var hostMemberId in hostsMembersIds)

[Killed] Block removal mutation
Meetings/Meeting.cs:119:13
             this.AddDomainEvent(new MeetingCreatedDomainEvent(this.Id));
             var rsvpDate = SystemClock.Now;
             if (hostsMembersIds.Any())
-            {
-                foreach (var hostMemberId in hostsMembersIds)
-                {
-                    _attendees.Add(MeetingAttendee.CreateNew(this.Id, hostMemberId, rsvpDate, MeetingAttendeeRole.Host, 0, MoneyValue.Undefined));
-                }
-            }
+            {}
             else
             {

[Killed] Block removal mutation
Meetings/Meeting.cs:121:17
             if (hostsMembersIds.Any())
             {
                 foreach (var hostMemberId in hostsMembersIds)
-                {
-                    _attendees.Add(MeetingAttendee.CreateNew(this.Id, hostMemberId, rsvpDate, MeetingAttendeeRole.Host, 0, MoneyValue.Undefined));
-                }
+                {}
             }
             else

[Killed] Statement mutation
Meetings/Meeting.cs:122:21
             {
                 foreach (var hostMemberId in hostsMembersIds)
                 {
-                    _attendees.Add(MeetingAttendee.CreateNew(this.Id, hostMemberId, rsvpDate, MeetingAttendeeRole.Host, 0, MoneyValue.Undefined));
+                    ;
                 }
             }

[Killed] Block removal mutation
Meetings/Meeting.cs:126:13
                 }
             }
             else
-            {
-                _attendees.Add(MeetingAttendee.CreateNew(this.Id, creatorId, rsvpDate, MeetingAttendeeRole.Host, 0, MoneyValue.Undefined));
-            }
+            {}
         }
 

[Killed] Statement mutation
Meetings/Meeting.cs:127:17
             }
             else
             {
-                _attendees.Add(MeetingAttendee.CreateNew(this.Id, creatorId, rsvpDate, MeetingAttendeeRole.Host, 0, MoneyValue.Undefined));
+                ;
             }
         }

[NoCoverage] Block removal mutation
Meetings/Meeting.cs:140:9
             Term rsvpTerm,
             MoneyValue eventFee,
             MemberId modifyUserId)
-        {
-            this.CheckRule(new AttendeesLimitCannotBeChangedToSmallerThanActiveAttendeesRule(
-                meetingLimits,
-                this.GetAllActiveAttendeesWithGuestsNumber()));
-
-            _title = title;
-            _term = term;
-            _description = description;
-            _location = location;
-            _meetingLimits = meetingLimits;
-            this.SetRsvpTerm(rsvpTerm, _term);
-            _eventFee = eventFee;
-
-            _changeDate = SystemClock.Now;
-            _changeMemberId = modifyUserId;
-
-            this.AddDomainEvent(new MeetingMainAttributesChangedDomainEvent(this.Id));
-        }
+        {}
 
         public void AddAttendee(MeetingGroup meetingGroup, MemberId attendeeId, int guestsNumber)

[NoCoverage] Statement mutation
Meetings/Meeting.cs:141:13
             MoneyValue eventFee,
             MemberId modifyUserId)
         {
-            this.CheckRule(new AttendeesLimitCannotBeChangedToSmallerThanActiveAttendeesRule(
-                meetingLimits,
-                this.GetAllActiveAttendeesWithGuestsNumber()));
+            ;
 
             _title = title;

[NoCoverage] Statement mutation
Meetings/Meeting.cs:150:13
             _description = description;
             _location = location;
             _meetingLimits = meetingLimits;
-            this.SetRsvpTerm(rsvpTerm, _term);
+            ;
             _eventFee = eventFee;
 

[NoCoverage] Statement mutation
Meetings/Meeting.cs:156:13
             _changeDate = SystemClock.Now;
             _changeMemberId = modifyUserId;
 
-            this.AddDomainEvent(new MeetingMainAttributesChangedDomainEvent(this.Id));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:160:9
         }
 
         public void AddAttendee(MeetingGroup meetingGroup, MemberId attendeeId, int guestsNumber)
-        {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-
-            this.CheckRule(new AttendeeCanBeAddedOnlyInRsvpTermRule(_rsvpTerm));
-
-            this.CheckRule(new MeetingAttendeeMustBeAMemberOfGroupRule(attendeeId, meetingGroup));
-
-            this.CheckRule(new MemberCannotBeAnAttendeeOfMeetingMoreThanOnceRule(attendeeId, _attendees));
-
-            this.CheckRule(new MeetingGuestsNumberIsAboveLimitRule(_meetingLimits.GuestsLimit, guestsNumber));
-
-            this.CheckRule(new MeetingAttendeesNumberIsAboveLimitRule(_meetingLimits.AttendeesLimit, this.GetAllActiveAttendeesWithGuestsNumber(), guestsNumber));
-
-            var notAttendee = this.GetActiveNotAttendee(attendeeId);
-            notAttendee?.ChangeDecision();
-
-            _attendees.Add(MeetingAttendee.CreateNew(
-                this.Id,
-                attendeeId,
-                SystemClock.Now,
-                MeetingAttendeeRole.Attendee,
-                guestsNumber,
-                _eventFee));
-        }
+        {}
 
         public void AddNotAttendee(MemberId memberId)

[Killed] Statement mutation
Meetings/Meeting.cs:161:13
 
         public void AddAttendee(MeetingGroup meetingGroup, MemberId attendeeId, int guestsNumber)
         {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
+            ;
 
             this.CheckRule(new AttendeeCanBeAddedOnlyInRsvpTermRule(_rsvpTerm));

[Killed] Statement mutation
Meetings/Meeting.cs:163:13
         {
             this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
 
-            this.CheckRule(new AttendeeCanBeAddedOnlyInRsvpTermRule(_rsvpTerm));
+            ;
 
             this.CheckRule(new MeetingAttendeeMustBeAMemberOfGroupRule(attendeeId, meetingGroup));

[Killed] Statement mutation
Meetings/Meeting.cs:165:13
 
             this.CheckRule(new AttendeeCanBeAddedOnlyInRsvpTermRule(_rsvpTerm));
 
-            this.CheckRule(new MeetingAttendeeMustBeAMemberOfGroupRule(attendeeId, meetingGroup));
+            ;
 
             this.CheckRule(new MemberCannotBeAnAttendeeOfMeetingMoreThanOnceRule(attendeeId, _attendees));

[Killed] Statement mutation
Meetings/Meeting.cs:167:13
 
             this.CheckRule(new MeetingAttendeeMustBeAMemberOfGroupRule(attendeeId, meetingGroup));
 
-            this.CheckRule(new MemberCannotBeAnAttendeeOfMeetingMoreThanOnceRule(attendeeId, _attendees));
+            ;
 
             this.CheckRule(new MeetingGuestsNumberIsAboveLimitRule(_meetingLimits.GuestsLimit, guestsNumber));

[Killed] Statement mutation
Meetings/Meeting.cs:169:13
 
             this.CheckRule(new MemberCannotBeAnAttendeeOfMeetingMoreThanOnceRule(attendeeId, _attendees));
 
-            this.CheckRule(new MeetingGuestsNumberIsAboveLimitRule(_meetingLimits.GuestsLimit, guestsNumber));
+            ;
 
             this.CheckRule(new MeetingAttendeesNumberIsAboveLimitRule(_meetingLimits.AttendeesLimit, this.GetAllActiveAttendeesWithGuestsNumber(), guestsNumber));

[Killed] Statement mutation
Meetings/Meeting.cs:171:13
 
             this.CheckRule(new MeetingGuestsNumberIsAboveLimitRule(_meetingLimits.GuestsLimit, guestsNumber));
 
-            this.CheckRule(new MeetingAttendeesNumberIsAboveLimitRule(_meetingLimits.AttendeesLimit, this.GetAllActiveAttendeesWithGuestsNumber(), guestsNumber));
+            ;
 
             var notAttendee = this.GetActiveNotAttendee(attendeeId);

[Killed] Statement mutation
Meetings/Meeting.cs:174:13
             this.CheckRule(new MeetingAttendeesNumberIsAboveLimitRule(_meetingLimits.AttendeesLimit, this.GetAllActiveAttendeesWithGuestsNumber(), guestsNumber));
 
             var notAttendee = this.GetActiveNotAttendee(attendeeId);
-            notAttendee?.ChangeDecision();
+            ;
 
             _attendees.Add(MeetingAttendee.CreateNew(

[Killed] Statement mutation
Meetings/Meeting.cs:176:13
             var notAttendee = this.GetActiveNotAttendee(attendeeId);
             notAttendee?.ChangeDecision();
 
-            _attendees.Add(MeetingAttendee.CreateNew(
-                this.Id,
-                attendeeId,
-                SystemClock.Now,
-                MeetingAttendeeRole.Attendee,
-                guestsNumber,
-                _eventFee));
+            ;
         }
 

[Killed] Statement mutation
Meetings/Meeting.cs:189:13
         {
             this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
 
-            this.CheckRule(new MemberCannotBeNotAttendeeTwiceRule(_notAttendees, memberId));
+            ;
 
             _notAttendees.Add(MeetingNotAttendee.CreateNew(this.Id, memberId));

[Killed] Statement mutation
Meetings/Meeting.cs:191:13
 
             this.CheckRule(new MemberCannotBeNotAttendeeTwiceRule(_notAttendees, memberId));
 
-            _notAttendees.Add(MeetingNotAttendee.CreateNew(this.Id, memberId));
+            ;
 
             var attendee = this.GetActiveAttendee(memberId);

[Killed] Statement mutation
Meetings/Meeting.cs:195:13
 
             var attendee = this.GetActiveAttendee(memberId);
 
-            attendee?.ChangeDecision();
+            ;
 
             var nextWaitlistMember = _waitlistMembers

[Killed] Linq method mutation (FirstOrDefault() to First())
Meetings/Meeting.cs:197:38
 
             attendee?.ChangeDecision();
 
-            var nextWaitlistMember = _waitlistMembers
-                .Where(x => x.IsActive())
-                .OrderBy(x => x.SignUpDate)
-                .FirstOrDefault();
+            var nextWaitlistMember = _waitlistMembers
+                .Where(x => x.IsActive())
+                .OrderBy(x => x.SignUpDate)
+                .First();
             if (nextWaitlistMember != null)
             {

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
Meetings/Meeting.cs:197:38
 
             attendee?.ChangeDecision();
 
-            var nextWaitlistMember = _waitlistMembers
-                .Where(x => x.IsActive())
-                .OrderBy(x => x.SignUpDate)
-                .FirstOrDefault();
+            var nextWaitlistMember = _waitlistMembers
+                .Where(x => x.IsActive())
+                .OrderByDescending(x => x.SignUpDate)
+                .FirstOrDefault();
             if (nextWaitlistMember != null)
             {

[Killed] Equality mutation
Meetings/Meeting.cs:201:17
                 .Where(x => x.IsActive())
                 .OrderBy(x => x.SignUpDate)
                 .FirstOrDefault();
-            if (nextWaitlistMember != null)
+            if (nextWaitlistMember == null)
             {
                 _attendees.Add(MeetingAttendee.CreateNew(

[NoCoverage] Block removal mutation
Meetings/Meeting.cs:202:13
                 .OrderBy(x => x.SignUpDate)
                 .FirstOrDefault();
             if (nextWaitlistMember != null)
-            {
-                _attendees.Add(MeetingAttendee.CreateNew(
-                    this.Id,
-                    nextWaitlistMember.MemberId,
-                    nextWaitlistMember.SignUpDate,
-                    MeetingAttendeeRole.Attendee,
-                    0,
-                    this._eventFee));
-                nextWaitlistMember.MarkIsMovedToAttendees();
-            }
+            {}
         }
 

[NoCoverage] Statement mutation
Meetings/Meeting.cs:203:17
                 .FirstOrDefault();
             if (nextWaitlistMember != null)
             {
-                _attendees.Add(MeetingAttendee.CreateNew(
-                    this.Id,
-                    nextWaitlistMember.MemberId,
-                    nextWaitlistMember.SignUpDate,
-                    MeetingAttendeeRole.Attendee,
-                    0,
-                    this._eventFee));
+                ;
                 nextWaitlistMember.MarkIsMovedToAttendees();
             }

[NoCoverage] Statement mutation
Meetings/Meeting.cs:210:17
                     MeetingAttendeeRole.Attendee,
                     0,
                     this._eventFee));
-                nextWaitlistMember.MarkIsMovedToAttendees();
+                ;
             }
         }

[Killed] Block removal mutation
Meetings/Meeting.cs:215:9
         }
 
         public void ChangeNotAttendeeDecision(MemberId memberId)
-        {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-
-            this.CheckRule(new NotActiveNotAttendeeCannotChangeDecisionRule(_notAttendees, memberId));
-
-            var notAttendee = _notAttendees.Single(x => x.IsActiveNotAttendee(memberId));
-
-            notAttendee.ChangeDecision();
-        }
+        {}
 
         public void SignUpMemberToWaitlist(MeetingGroup meetingGroup, MemberId memberId)

[Killed] Statement mutation
Meetings/Meeting.cs:218:13
         {
             this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
 
-            this.CheckRule(new NotActiveNotAttendeeCannotChangeDecisionRule(_notAttendees, memberId));
+            ;
 
             var notAttendee = _notAttendees.Single(x => x.IsActiveNotAttendee(memberId));

[Survived] Linq method mutation (Single() to SingleOrDefault())
Meetings/Meeting.cs:220:31
 
             this.CheckRule(new NotActiveNotAttendeeCannotChangeDecisionRule(_notAttendees, memberId));
 
-            var notAttendee = _notAttendees.Single(x => x.IsActiveNotAttendee(memberId));
+            var notAttendee = _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(memberId));
 
             notAttendee.ChangeDecision();

[Killed] Statement mutation
Meetings/Meeting.cs:222:13
 
             var notAttendee = _notAttendees.Single(x => x.IsActiveNotAttendee(memberId));
 
-            notAttendee.ChangeDecision();
+            ;
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:226:9
         }
 
         public void SignUpMemberToWaitlist(MeetingGroup meetingGroup, MemberId memberId)
-        {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-
-            this.CheckRule(new AttendeeCanBeAddedOnlyInRsvpTermRule(_rsvpTerm));
-
-            this.CheckRule(new MemberOnWaitlistMustBeAMemberOfGroupRule(meetingGroup, memberId, _attendees));
-
-            this.CheckRule(new MemberCannotBeMoreThanOnceOnMeetingWaitlistRule(_waitlistMembers, memberId));
-
-            _waitlistMembers.Add(MeetingWaitlistMember.CreateNew(this.Id, memberId));
-        }
+        {}
 
         public void SignOffMemberFromWaitlist(MemberId memberId)

[Killed] Statement mutation
Meetings/Meeting.cs:231:13
 
             this.CheckRule(new AttendeeCanBeAddedOnlyInRsvpTermRule(_rsvpTerm));
 
-            this.CheckRule(new MemberOnWaitlistMustBeAMemberOfGroupRule(meetingGroup, memberId, _attendees));
+            ;
 
             this.CheckRule(new MemberCannotBeMoreThanOnceOnMeetingWaitlistRule(_waitlistMembers, memberId));

[Killed] Statement mutation
Meetings/Meeting.cs:233:13
 
             this.CheckRule(new MemberOnWaitlistMustBeAMemberOfGroupRule(meetingGroup, memberId, _attendees));
 
-            this.CheckRule(new MemberCannotBeMoreThanOnceOnMeetingWaitlistRule(_waitlistMembers, memberId));
+            ;
 
             _waitlistMembers.Add(MeetingWaitlistMember.CreateNew(this.Id, memberId));

[Killed] Statement mutation
Meetings/Meeting.cs:235:13
 
             this.CheckRule(new MemberCannotBeMoreThanOnceOnMeetingWaitlistRule(_waitlistMembers, memberId));
 
-            _waitlistMembers.Add(MeetingWaitlistMember.CreateNew(this.Id, memberId));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:239:9
         }
 
         public void SignOffMemberFromWaitlist(MemberId memberId)
-        {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-
-            this.CheckRule(new NotActiveMemberOfWaitlistCannotBeSignedOffRule(_waitlistMembers, memberId));
-
-            var memberOnWaitlist = this.GetActiveMemberOnWaitlist(memberId);
-
-            memberOnWaitlist.SignOff();
-        }
+        {}
 
         public void SetHostRole(MeetingGroup meetingGroup, MemberId settingMemberId, MemberId newOrganizerId)

[Killed] Statement mutation
Meetings/Meeting.cs:242:13
         {
             this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
 
-            this.CheckRule(new NotActiveMemberOfWaitlistCannotBeSignedOffRule(_waitlistMembers, memberId));
+            ;
 
             var memberOnWaitlist = this.GetActiveMemberOnWaitlist(memberId);

[Killed] Statement mutation
Meetings/Meeting.cs:246:13
 
             var memberOnWaitlist = this.GetActiveMemberOnWaitlist(memberId);
 
-            memberOnWaitlist.SignOff();
+            ;
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:250:9
         }
 
         public void SetHostRole(MeetingGroup meetingGroup, MemberId settingMemberId, MemberId newOrganizerId)
-        {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-
-            this.CheckRule(new OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule(settingMemberId, meetingGroup, _attendees));
-
-            this.CheckRule(new OnlyMeetingAttendeeCanHaveChangedRoleRule(_attendees, newOrganizerId));
-
-            var attendee = this.GetActiveAttendee(newOrganizerId);
-
-            attendee.SetAsHost();
-        }
+        {}
 
         public void SetAttendeeRole(MeetingGroup meetingGroup, MemberId settingMemberId, MemberId newOrganizerId)

[Killed] Statement mutation
Meetings/Meeting.cs:253:13
         {
             this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
 
-            this.CheckRule(new OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule(settingMemberId, meetingGroup, _attendees));
+            ;
 
             this.CheckRule(new OnlyMeetingAttendeeCanHaveChangedRoleRule(_attendees, newOrganizerId));

[Survived] Statement mutation
Meetings/Meeting.cs:255:13
 
             this.CheckRule(new OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule(settingMemberId, meetingGroup, _attendees));
 
-            this.CheckRule(new OnlyMeetingAttendeeCanHaveChangedRoleRule(_attendees, newOrganizerId));
+            ;
 
             var attendee = this.GetActiveAttendee(newOrganizerId);

[Killed] Statement mutation
Meetings/Meeting.cs:259:13
 
             var attendee = this.GetActiveAttendee(newOrganizerId);
 
-            attendee.SetAsHost();
+            ;
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:263:9
         }
 
         public void SetAttendeeRole(MeetingGroup meetingGroup, MemberId settingMemberId, MemberId newOrganizerId)
-        {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-
-            this.CheckRule(new OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule(settingMemberId, meetingGroup, _attendees));
-
-            this.CheckRule(new OnlyMeetingAttendeeCanHaveChangedRoleRule(_attendees, newOrganizerId));
-
-            var attendee = this.GetActiveAttendee(newOrganizerId);
-
-            attendee.SetAsAttendee();
-
-            var meetingHostNumber = _attendees.Count(x => x.IsActiveHost());
-
-            this.CheckRule(new MeetingMustHaveAtLeastOneHostRule(meetingHostNumber));
-        }
+        {}
 
         public MeetingGroupId GetMeetingGroupId() => _meetingGroupId;

[Killed] Statement mutation
Meetings/Meeting.cs:272:13
 
             var attendee = this.GetActiveAttendee(newOrganizerId);
 
-            attendee.SetAsAttendee();
+            ;
 
             var meetingHostNumber = _attendees.Count(x => x.IsActiveHost());

[Killed] Statement mutation
Meetings/Meeting.cs:276:13
 
             var meetingHostNumber = _attendees.Count(x => x.IsActiveHost());
 
-            this.CheckRule(new MeetingMustHaveAtLeastOneHostRule(meetingHostNumber));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:282:9
         public MeetingGroupId GetMeetingGroupId() => _meetingGroupId;
 
         public void Cancel(MemberId cancelMemberId)
-        {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-
-            if (!_isCanceled)
-            {
-                _isCanceled = true;
-                _cancelDate = SystemClock.Now;
-                _cancelMemberId = cancelMemberId;
-
-                this.AddDomainEvent(new MeetingCanceledDomainEvent(this.Id, _cancelMemberId, _cancelDate.Value));
-            }
-        }
+        {}
 
         public void RemoveAttendee(MemberId attendeeId, MemberId removingPersonId, string reason)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/Meeting.cs:285:17
         {
             this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
 
-            if (!_isCanceled)
+            if (_isCanceled)
             {
                 _isCanceled = true;

[Killed] Block removal mutation
Meetings/Meeting.cs:286:13
             this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
 
             if (!_isCanceled)
-            {
-                _isCanceled = true;
-                _cancelDate = SystemClock.Now;
-                _cancelMemberId = cancelMemberId;
-
-                this.AddDomainEvent(new MeetingCanceledDomainEvent(this.Id, _cancelMemberId, _cancelDate.Value));
-            }
+            {}
         }
 

[Survived] Boolean mutation
Meetings/Meeting.cs:287:31
 
             if (!_isCanceled)
             {
-                _isCanceled = true;
+                _isCanceled = false;
                 _cancelDate = SystemClock.Now;
                 _cancelMemberId = cancelMemberId;

[Killed] Statement mutation
Meetings/Meeting.cs:291:17
                 _cancelDate = SystemClock.Now;
                 _cancelMemberId = cancelMemberId;
 
-                this.AddDomainEvent(new MeetingCanceledDomainEvent(this.Id, _cancelMemberId, _cancelDate.Value));
+                ;
             }
         }

[Killed] Block removal mutation
Meetings/Meeting.cs:296:9
         }
 
         public void RemoveAttendee(MemberId attendeeId, MemberId removingPersonId, string reason)
-        {
-            this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-            this.CheckRule(new OnlyActiveAttendeeCanBeRemovedFromMeetingRule(_attendees, attendeeId));
-
-            var attendee = this.GetActiveAttendee(attendeeId);
-
-            attendee.Remove(removingPersonId, reason);
-        }
+        {}
 
         public void MarkAttendeeFeeAsPayed(MemberId memberId)

[Killed] Statement mutation
Meetings/Meeting.cs:298:13
         public void RemoveAttendee(MemberId attendeeId, MemberId removingPersonId, string reason)
         {
             this.CheckRule(new MeetingCannotBeChangedAfterStartRule(_term));
-            this.CheckRule(new OnlyActiveAttendeeCanBeRemovedFromMeetingRule(_attendees, attendeeId));
+            ;
 
             var attendee = this.GetActiveAttendee(attendeeId);

[Killed] Statement mutation
Meetings/Meeting.cs:302:13
 
             var attendee = this.GetActiveAttendee(attendeeId);
 
-            attendee.Remove(removingPersonId, reason);
+            ;
         }
 

[NoCoverage] Block removal mutation
Meetings/Meeting.cs:306:9
         }
 
         public void MarkAttendeeFeeAsPayed(MemberId memberId)
-        {
-            var attendee = GetActiveAttendee(memberId);
-
-            attendee.MarkFeeAsPayed();
-        }
+        {}
 
         public MeetingComment AddComment(MemberId authorId, string comment, MeetingGroup meetingGroup, MeetingCommentingConfiguration meetingCommentingConfiguration)

[NoCoverage] Statement mutation
Meetings/Meeting.cs:309:13
         {
             var attendee = GetActiveAttendee(memberId);
 
-            attendee.MarkFeeAsPayed();
+            ;
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:321:9
                 meetingCommentingConfiguration);
 
         public MeetingCommentingConfiguration CreateCommentingConfiguration()
-        {
-            return MeetingCommentingConfiguration.Create(this.Id);
-        }
+        {}
 
         private MeetingWaitlistMember GetActiveMemberOnWaitlist(MemberId memberId)

[Killed] Block removal mutation
Meetings/Meeting.cs:326:9
         }
 
         private MeetingWaitlistMember GetActiveMemberOnWaitlist(MemberId memberId)
-        {
-            return _waitlistMembers.SingleOrDefault(x => x.IsActiveOnWaitList(memberId));
-        }
+        {}
 
         private MeetingAttendee GetActiveAttendee(MemberId attendeeId)

[Survived] Linq method mutation (SingleOrDefault() to Single())
Meetings/Meeting.cs:327:20
 
         private MeetingWaitlistMember GetActiveMemberOnWaitlist(MemberId memberId)
         {
-            return _waitlistMembers.SingleOrDefault(x => x.IsActiveOnWaitList(memberId));
+            return _waitlistMembers.Single(x => x.IsActiveOnWaitList(memberId));
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:331:9
         }
 
         private MeetingAttendee GetActiveAttendee(MemberId attendeeId)
-        {
-            return _attendees.SingleOrDefault(x => x.IsActiveAttendee(attendeeId));
-        }
+        {}
 
         private MeetingNotAttendee GetActiveNotAttendee(MemberId memberId)

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Meeting.cs:332:20
 
         private MeetingAttendee GetActiveAttendee(MemberId attendeeId)
         {
-            return _attendees.SingleOrDefault(x => x.IsActiveAttendee(attendeeId));
+            return _attendees.Single(x => x.IsActiveAttendee(attendeeId));
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:336:9
         }
 
         private MeetingNotAttendee GetActiveNotAttendee(MemberId memberId)
-        {
-            return _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(memberId));
-        }
+        {}
 
         private int GetAllActiveAttendeesWithGuestsNumber()

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Meeting.cs:337:20
 
         private MeetingNotAttendee GetActiveNotAttendee(MemberId memberId)
         {
-            return _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(memberId));
+            return _notAttendees.Single(x => x.IsActiveNotAttendee(memberId));
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:341:9
         }
 
         private int GetAllActiveAttendeesWithGuestsNumber()
-        {
-            return _attendees.Where(x => x.IsActive()).Sum(x => x.GetAttendeeWithGuestsNumber());
-        }
+        {}
 
         private void SetRsvpTerm(Term rsvpTerm, MeetingTerm meetingTerm)

[Killed] Linq method mutation (Sum() to Max())
Meetings/Meeting.cs:342:20
 
         private int GetAllActiveAttendeesWithGuestsNumber()
         {
-            return _attendees.Where(x => x.IsActive()).Sum(x => x.GetAttendeeWithGuestsNumber());
+            return _attendees.Where(x => x.IsActive()).Max(x => x.GetAttendeeWithGuestsNumber());
         }
 

[Killed] Block removal mutation
Meetings/Meeting.cs:346:9
         }
 
         private void SetRsvpTerm(Term rsvpTerm, MeetingTerm meetingTerm)
-        {
-            if (!rsvpTerm.EndDate.HasValue || rsvpTerm.EndDate > meetingTerm.StartDate)
-            {
-                _rsvpTerm = Term.CreateNewBetweenDates(rsvpTerm.StartDate, meetingTerm.StartDate);
-            }
-            else
-            {
-                _rsvpTerm = rsvpTerm;
-            }
-        }
+        {}
     }
 }

[Killed] Equality mutation
Meetings/Meeting.cs:347:47
 
         private void SetRsvpTerm(Term rsvpTerm, MeetingTerm meetingTerm)
         {
-            if (!rsvpTerm.EndDate.HasValue || rsvpTerm.EndDate > meetingTerm.StartDate)
+            if (!rsvpTerm.EndDate.HasValue || rsvpTerm.EndDate < meetingTerm.StartDate)
             {
                 _rsvpTerm = Term.CreateNewBetweenDates(rsvpTerm.StartDate, meetingTerm.StartDate);
