[Killed] Negate expression
Meetings/Meeting.cs:347:17
 
         private void SetRsvpTerm(Term rsvpTerm, MeetingTerm meetingTerm)
         {
-            if (!rsvpTerm.EndDate.HasValue || rsvpTerm.EndDate > meetingTerm.StartDate)
+            if (!(!rsvpTerm.EndDate.HasValue || rsvpTerm.EndDate > meetingTerm.StartDate))
             {
                 _rsvpTerm = Term.CreateNewBetweenDates(rsvpTerm.StartDate, meetingTerm.StartDate);

[Killed] Block removal mutation
Meetings/Meeting.cs:348:13
         private void SetRsvpTerm(Term rsvpTerm, MeetingTerm meetingTerm)
         {
             if (!rsvpTerm.EndDate.HasValue || rsvpTerm.EndDate > meetingTerm.StartDate)
-            {
-                _rsvpTerm = Term.CreateNewBetweenDates(rsvpTerm.StartDate, meetingTerm.StartDate);
-            }
+            {}
             else
             {

[Killed] Block removal mutation
Meetings/Meeting.cs:352:13
                 _rsvpTerm = Term.CreateNewBetweenDates(rsvpTerm.StartDate, meetingTerm.StartDate);
             }
             else
-            {
-                _rsvpTerm = rsvpTerm;
-            }
+            {}
         }
     }
