[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:50:9
             MeetingAttendeeRole role,
             int guestsNumber,
             MoneyValue eventFee)
-        {
-            return new MeetingAttendee(meetingId, attendeeId, decisionDate, role, guestsNumber, eventFee);
-        }
+        {}
 
         private MeetingAttendee(

[Killed] Boolean mutation
Meetings/MeetingAttendee.cs:67:32
             this._decisionDate = decisionDate;
             this._role = role;
             _guestsNumber = guestsNumber;
-            _decisionChanged = false;
+            _decisionChanged = true;
             _isFeePaid = false;
 

[Survived] Boolean mutation
Meetings/MeetingAttendee.cs:68:26
             this._role = role;
             _guestsNumber = guestsNumber;
             _decisionChanged = false;
-            _isFeePaid = false;
+            _isFeePaid = true;
 
             if (eventFee != MoneyValue.Undefined)

[Survived] Equality mutation
Meetings/MeetingAttendee.cs:70:17
             _decisionChanged = false;
             _isFeePaid = false;
 
-            if (eventFee != MoneyValue.Undefined)
+            if (eventFee == MoneyValue.Undefined)
             {
                 _fee = (1 + guestsNumber) * eventFee;

[NoCoverage] Block removal mutation
Meetings/MeetingAttendee.cs:71:13
             _isFeePaid = false;
 
             if (eventFee != MoneyValue.Undefined)
-            {
-                _fee = (1 + guestsNumber) * eventFee;
-            }
+            {}
             else
             {

[NoCoverage] Arithmetic mutation
Meetings/MeetingAttendee.cs:72:25
 
             if (eventFee != MoneyValue.Undefined)
             {
-                _fee = (1 + guestsNumber) * eventFee;
+                _fee = (1 - guestsNumber) * eventFee;
             }
             else

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:75:13
                 _fee = (1 + guestsNumber) * eventFee;
             }
             else
-            {
-                _fee = MoneyValue.Undefined;
-            }
+            {}
 
             this.AddDomainEvent(new MeetingAttendeeAddedDomainEvent(

[Killed] Statement mutation
Meetings/MeetingAttendee.cs:79:13
                 _fee = MoneyValue.Undefined;
             }
 
-            this.AddDomainEvent(new MeetingAttendeeAddedDomainEvent(
-                this.MeetingId,
-                AttendeeId,
-                decisionDate,
-                role.Value,
-                guestsNumber,
-                _fee.Value,
-                _fee.Currency));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:90:9
         }
 
         internal void ChangeDecision()
-        {
-            _decisionChanged = true;
-            _decisionChangeDate = SystemClock.Now;
-
-            this.AddDomainEvent(new MeetingAttendeeChangedDecisionDomainEvent(this.AttendeeId, this.MeetingId));
-        }
+        {}
 
         internal bool IsActiveAttendee(MemberId attendeeId)

[Survived] Boolean mutation
Meetings/MeetingAttendee.cs:91:32
 
         internal void ChangeDecision()
         {
-            _decisionChanged = true;
+            _decisionChanged = false;
             _decisionChangeDate = SystemClock.Now;
 

[Killed] Statement mutation
Meetings/MeetingAttendee.cs:94:13
             _decisionChanged = true;
             _decisionChangeDate = SystemClock.Now;
 
-            this.AddDomainEvent(new MeetingAttendeeChangedDecisionDomainEvent(this.AttendeeId, this.MeetingId));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:98:9
         }
 
         internal bool IsActiveAttendee(MemberId attendeeId)
-        {
-            return this.AttendeeId == attendeeId && !_decisionChanged;
-        }
+        {}
 
         internal bool IsActive()

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/MeetingAttendee.cs:99:53
 
         internal bool IsActiveAttendee(MemberId attendeeId)
         {
-            return this.AttendeeId == attendeeId && !_decisionChanged;
+            return this.AttendeeId == attendeeId && _decisionChanged;
         }
 

[Killed] Logical mutation
Meetings/MeetingAttendee.cs:99:20
 
         internal bool IsActiveAttendee(MemberId attendeeId)
         {
-            return this.AttendeeId == attendeeId && !_decisionChanged;
+            return this.AttendeeId == attendeeId || !_decisionChanged;
         }
 

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:103:9
         }
 
         internal bool IsActive()
-        {
-            return !_decisionChangeDate.HasValue && !_isRemoved;
-        }
+        {}
 
         internal bool IsActiveHost()

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/MeetingAttendee.cs:104:53
 
         internal bool IsActive()
         {
-            return !_decisionChangeDate.HasValue && !_isRemoved;
+            return !_decisionChangeDate.HasValue && _isRemoved;
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/MeetingAttendee.cs:104:20
 
         internal bool IsActive()
         {
-            return !_decisionChangeDate.HasValue && !_isRemoved;
+            return _decisionChangeDate.HasValue  && !_isRemoved;
         }
 

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:108:9
         }
 
         internal bool IsActiveHost()
-        {
-            return this.IsActive() && _role == MeetingAttendeeRole.Host;
-        }
+        {}
 
         internal int GetAttendeeWithGuestsNumber()

[Killed] Equality mutation
Meetings/MeetingAttendee.cs:109:39
 
         internal bool IsActiveHost()
         {
-            return this.IsActive() && _role == MeetingAttendeeRole.Host;
+            return this.IsActive() && _role != MeetingAttendeeRole.Host;
         }
 

[Killed] Logical mutation
Meetings/MeetingAttendee.cs:109:20
 
         internal bool IsActiveHost()
         {
-            return this.IsActive() && _role == MeetingAttendeeRole.Host;
+            return this.IsActive() || _role == MeetingAttendeeRole.Host;
         }
 

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:113:9
         }
 
         internal int GetAttendeeWithGuestsNumber()
-        {
-            return 1 + _guestsNumber;
-        }
+        {}
 
         internal void SetAsHost()

[Killed] Arithmetic mutation
Meetings/MeetingAttendee.cs:114:20
 
         internal int GetAttendeeWithGuestsNumber()
         {
-            return 1 + _guestsNumber;
+            return 1 - _guestsNumber;
         }
 

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:118:9
         }
 
         internal void SetAsHost()
-        {
-            _role = MeetingAttendeeRole.Host;
-
-            this.AddDomainEvent(new NewMeetingHostSetDomainEvent(this.MeetingId, this.AttendeeId));
-        }
+        {}
 
         internal void SetAsAttendee()

[Killed] Statement mutation
Meetings/MeetingAttendee.cs:121:13
         {
             _role = MeetingAttendeeRole.Host;
 
-            this.AddDomainEvent(new NewMeetingHostSetDomainEvent(this.MeetingId, this.AttendeeId));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:125:9
         }
 
         internal void SetAsAttendee()
-        {
-            this.CheckRule(new MemberCannotHaveSetAttendeeRoleMoreThanOnceRule(_role));
-            _role = MeetingAttendeeRole.Attendee;
-
-            this.AddDomainEvent(new MemberSetAsAttendeeDomainEvent(this.MeetingId, this.AttendeeId));
-        }
+        {}
 
         internal void Remove(MemberId removingMemberId, string reason)

[Killed] Statement mutation
Meetings/MeetingAttendee.cs:126:13
 
         internal void SetAsAttendee()
         {
-            this.CheckRule(new MemberCannotHaveSetAttendeeRoleMoreThanOnceRule(_role));
+            ;
             _role = MeetingAttendeeRole.Attendee;
 

[Killed] Statement mutation
Meetings/MeetingAttendee.cs:129:13
             this.CheckRule(new MemberCannotHaveSetAttendeeRoleMoreThanOnceRule(_role));
             _role = MeetingAttendeeRole.Attendee;
 
-            this.AddDomainEvent(new MemberSetAsAttendeeDomainEvent(this.MeetingId, this.AttendeeId));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/MeetingAttendee.cs:133:9
         }
 
         internal void Remove(MemberId removingMemberId, string reason)
-        {
-            this.CheckRule(new ReasonOfRemovingAttendeeFromMeetingMustBeProvidedRule(reason));
-
-            _isRemoved = true;
-            _removedDate = SystemClock.Now;
-            _removingReason = reason;
-            _removingMemberId = removingMemberId;
-
-            this.AddDomainEvent(new MeetingAttendeeRemovedDomainEvent(this.AttendeeId, this.MeetingId, reason));
-        }
+        {}
 
         internal void MarkFeeAsPayed()

[Killed] Statement mutation
Meetings/MeetingAttendee.cs:134:13
 
         internal void Remove(MemberId removingMemberId, string reason)
         {
-            this.CheckRule(new ReasonOfRemovingAttendeeFromMeetingMustBeProvidedRule(reason));
+            ;
 
             _isRemoved = true;

[Killed] Statement mutation
Meetings/MeetingAttendee.cs:141:13
             _removingReason = reason;
             _removingMemberId = removingMemberId;
 
-            this.AddDomainEvent(new MeetingAttendeeRemovedDomainEvent(this.AttendeeId, this.MeetingId, reason));
+            ;
         }
 

[NoCoverage] Block removal mutation
Meetings/MeetingAttendee.cs:145:9
         }
 
         internal void MarkFeeAsPayed()
-        {
-            _isFeePaid = true;
-
-            this.AddDomainEvent(new MeetingAttendeeFeePaidDomainEvent(this.MeetingId, this.AttendeeId));
-        }
+        {}
     }
 }

[NoCoverage] Boolean mutation
Meetings/MeetingAttendee.cs:146:26
 
         internal void MarkFeeAsPayed()
         {
-            _isFeePaid = true;
+            _isFeePaid = false;
 
             this.AddDomainEvent(new MeetingAttendeeFeePaidDomainEvent(this.MeetingId, this.AttendeeId));

[NoCoverage] Statement mutation
Meetings/MeetingAttendee.cs:148:13
         {
             _isFeePaid = true;
 
-            this.AddDomainEvent(new MeetingAttendeeFeePaidDomainEvent(this.MeetingId, this.AttendeeId));
+            ;
         }
     }
