[Survived] String mutation
Meetings/MeetingAttendeeRole.cs:7:75
 {
     public class MeetingAttendeeRole : ValueObject
     {
-        public static MeetingAttendeeRole Host => new MeetingAttendeeRole("Host");
+        public static MeetingAttendeeRole Host => new MeetingAttendeeRole("");
 
         public static MeetingAttendeeRole Attendee => new MeetingAttendeeRole("Attendee");

[Killed] Block removal mutation
Meetings/MeetingAttendeeRole.cs:14:9
         public string Value { get; }
 
         private MeetingAttendeeRole(string value)
-        {
-            this.Value = value;
-        }
+        {}
     }
 }
