[Killed] Block removal mutation
Meetings/MeetingLimits.cs:13:9
         public int GuestsLimit { get; }
 
         private MeetingLimits(int? attendeesLimit, int guestsLimit)
-        {
-            AttendeesLimit = attendeesLimit;
-            GuestsLimit = guestsLimit;
-        }
+        {}
 
         public static MeetingLimits Create(int? attendeesLimit, int guestsLimit)

[Killed] Block removal mutation
Meetings/MeetingLimits.cs:19:9
         }
 
         public static MeetingLimits Create(int? attendeesLimit, int guestsLimit)
-        {
-            CheckRule(new MeetingAttendeesLimitCannotBeNegativeRule(attendeesLimit));
-
-            CheckRule(new MeetingGuestsLimitCannotBeNegativeRule(guestsLimit));
-
-            CheckRule(new MeetingAttendeesLimitMustBeGreaterThanGuestsLimitRule(attendeesLimit, guestsLimit));
-
-            return new MeetingLimits(attendeesLimit, guestsLimit);
-        }
+        {}
     }
 }

[Killed] Statement mutation
Meetings/MeetingLimits.cs:20:13
 
         public static MeetingLimits Create(int? attendeesLimit, int guestsLimit)
         {
-            CheckRule(new MeetingAttendeesLimitCannotBeNegativeRule(attendeesLimit));
+            ;
 
             CheckRule(new MeetingGuestsLimitCannotBeNegativeRule(guestsLimit));

[Killed] Statement mutation
Meetings/MeetingLimits.cs:22:13
         {
             CheckRule(new MeetingAttendeesLimitCannotBeNegativeRule(attendeesLimit));
 
-            CheckRule(new MeetingGuestsLimitCannotBeNegativeRule(guestsLimit));
+            ;
 
             CheckRule(new MeetingAttendeesLimitMustBeGreaterThanGuestsLimitRule(attendeesLimit, guestsLimit));

[Killed] Statement mutation
Meetings/MeetingLimits.cs:24:13
 
             CheckRule(new MeetingGuestsLimitCannotBeNegativeRule(guestsLimit));
 
-            CheckRule(new MeetingAttendeesLimitMustBeGreaterThanGuestsLimitRule(attendeesLimit, guestsLimit));
+            ;
 
             return new MeetingLimits(attendeesLimit, guestsLimit);
