[Survived] Block removal mutation
Meetings/MeetingLocation.cs:8:9
     public class MeetingLocation : ValueObject
     {
         public static MeetingLocation CreateNew(string name, string address, string postalCode, string city)
-        {
-            return new MeetingLocation(name, address, postalCode, city);
-        }
+        {}
 
         private MeetingLocation(string name, string address, string postalCode, string city)

[Survived] Block removal mutation
Meetings/MeetingLocation.cs:13:9
         }
 
         private MeetingLocation(string name, string address, string postalCode, string city)
-        {
-            Name = name;
-            Address = address;
-            PostalCode = postalCode;
-            City = city;
-        }
+        {}
 
         public string Name { get; }
