[Killed] Block removal mutation
Meetings/MeetingNotAttendee.cs:27:9
         }
 
         private MeetingNotAttendee(MeetingId meetingId, MemberId memberId)
-        {
-            this.MemberId = memberId;
-            this.MeetingId = meetingId;
-            _decisionDate = DateTime.UtcNow;
-
-            this.AddDomainEvent(new MeetingNotAttendeeAddedDomainEvent(this.MeetingId, this.MemberId));
-        }
+        {}
 
         internal static MeetingNotAttendee CreateNew(MeetingId meetingId, MemberId memberId)

[Killed] Statement mutation
Meetings/MeetingNotAttendee.cs:32:13
             this.MeetingId = meetingId;
             _decisionDate = DateTime.UtcNow;
 
-            this.AddDomainEvent(new MeetingNotAttendeeAddedDomainEvent(this.MeetingId, this.MemberId));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/MeetingNotAttendee.cs:36:9
         }
 
         internal static MeetingNotAttendee CreateNew(MeetingId meetingId, MemberId memberId)
-        {
-            return new MeetingNotAttendee(meetingId, memberId);
-        }
+        {}
 
         internal bool IsActiveNotAttendee(MemberId memberId)

[Killed] Block removal mutation
Meetings/MeetingNotAttendee.cs:41:9
         }
 
         internal bool IsActiveNotAttendee(MemberId memberId)
-        {
-            return !this._decisionChanged && this.MemberId == memberId;
-        }
+        {}
 
         internal void ChangeDecision()

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/MeetingNotAttendee.cs:42:20
 
         internal bool IsActiveNotAttendee(MemberId memberId)
         {
-            return !this._decisionChanged && this.MemberId == memberId;
+            return this._decisionChanged  && this.MemberId == memberId;
         }
 

[Killed] Equality mutation
Meetings/MeetingNotAttendee.cs:42:46
 
         internal bool IsActiveNotAttendee(MemberId memberId)
         {
-            return !this._decisionChanged && this.MemberId == memberId;
+            return !this._decisionChanged && this.MemberId != memberId;
         }
 

[Killed] Block removal mutation
Meetings/MeetingNotAttendee.cs:46:9
         }
 
         internal void ChangeDecision()
-        {
-            _decisionChanged = true;
-            _decisionChangeDate = SystemClock.Now;
-
-            this.AddDomainEvent(new MeetingNotAttendeeChangedDecisionDomainEvent(this.MemberId, this.MeetingId));
-        }
+        {}
     }
 }

[Killed] Statement mutation
Meetings/MeetingNotAttendee.cs:50:13
             _decisionChanged = true;
             _decisionChangeDate = SystemClock.Now;
 
-            this.AddDomainEvent(new MeetingNotAttendeeChangedDecisionDomainEvent(this.MemberId, this.MeetingId));
+            ;
         }
     }
