[Killed] Block removal mutation
Meetings/MeetingTerm.cs:14:9
         public DateTime EndDate { get; }
 
         public static MeetingTerm CreateNewBetweenDates(DateTime startDate, DateTime endDate)
-        {
-            return new MeetingTerm(startDate, endDate);
-        }
+        {}
 
         private MeetingTerm(DateTime startDate, DateTime endDate)

[Killed] Block removal mutation
Meetings/MeetingTerm.cs:19:9
         }
 
         private MeetingTerm(DateTime startDate, DateTime endDate)
-        {
-            this.StartDate = startDate;
-            this.EndDate = endDate;
-        }
+        {}
 
         internal bool IsAfterStart()

[Killed] Block removal mutation
Meetings/MeetingTerm.cs:25:9
         }
 
         internal bool IsAfterStart()
-        {
-            return SystemClock.Now > this.StartDate;
-        }
+        {}
     }
 }

[Killed] Equality mutation
Meetings/MeetingTerm.cs:26:20
 
         internal bool IsAfterStart()
         {
-            return SystemClock.Now > this.StartDate;
+            return SystemClock.Now < this.StartDate;
         }
     }

[Survived] Equality mutation
Meetings/MeetingTerm.cs:26:20
 
         internal bool IsAfterStart()
         {
-            return SystemClock.Now > this.StartDate;
+            return SystemClock.Now >= this.StartDate;
         }
     }
