[Killed] Block removal mutation
Meetings/MeetingWaitlistMember.cs:30:9
         }
 
         private MeetingWaitlistMember(MeetingId meetingId, MemberId memberId)
-        {
-            this.MemberId = memberId;
-            this.MeetingId = meetingId;
-            this.SignUpDate = SystemClock.Now;
-            _isMovedToAttendees = false;
-
-            this.AddDomainEvent(new MeetingWaitlistMemberAddedDomainEvent(this.MeetingId, this.MemberId));
-        }
+        {}
 
         internal static MeetingWaitlistMember CreateNew(MeetingId meetingId, MemberId memberId)

[Killed] Boolean mutation
Meetings/MeetingWaitlistMember.cs:34:35
             this.MemberId = memberId;
             this.MeetingId = meetingId;
             this.SignUpDate = SystemClock.Now;
-            _isMovedToAttendees = false;
+            _isMovedToAttendees = true;
 
             this.AddDomainEvent(new MeetingWaitlistMemberAddedDomainEvent(this.MeetingId, this.MemberId));

[Killed] Statement mutation
Meetings/MeetingWaitlistMember.cs:36:13
             this.SignUpDate = SystemClock.Now;
             _isMovedToAttendees = false;
 
-            this.AddDomainEvent(new MeetingWaitlistMemberAddedDomainEvent(this.MeetingId, this.MemberId));
+            ;
         }
 

[Killed] Block removal mutation
Meetings/MeetingWaitlistMember.cs:40:9
         }
 
         internal static MeetingWaitlistMember CreateNew(MeetingId meetingId, MemberId memberId)
-        {
-            return new MeetingWaitlistMember(meetingId, memberId);
-        }
+        {}
 
         internal void MarkIsMovedToAttendees()

[NoCoverage] Block removal mutation
Meetings/MeetingWaitlistMember.cs:45:9
         }
 
         internal void MarkIsMovedToAttendees()
-        {
-            _isMovedToAttendees = true;
-            _movedToAttendeesDate = SystemClock.Now;
-        }
+        {}
 
         internal bool IsActiveOnWaitList(MemberId memberId)

[NoCoverage] Boolean mutation
Meetings/MeetingWaitlistMember.cs:46:35
 
         internal void MarkIsMovedToAttendees()
         {
-            _isMovedToAttendees = true;
+            _isMovedToAttendees = false;
             _movedToAttendeesDate = SystemClock.Now;
         }

[Killed] Block removal mutation
Meetings/MeetingWaitlistMember.cs:51:9
         }
 
         internal bool IsActiveOnWaitList(MemberId memberId)
-        {
-            return this.MemberId == memberId && this.IsActive();
-        }
+        {}
 
         internal bool IsActive()

[Killed] Equality mutation
Meetings/MeetingWaitlistMember.cs:52:20
 
         internal bool IsActiveOnWaitList(MemberId memberId)
         {
-            return this.MemberId == memberId && this.IsActive();
+            return this.MemberId != memberId  && this.IsActive();
         }
 

[Survived] Logical mutation
Meetings/MeetingWaitlistMember.cs:52:20
 
         internal bool IsActiveOnWaitList(MemberId memberId)
         {
-            return this.MemberId == memberId && this.IsActive();
+            return this.MemberId == memberId || this.IsActive();
         }
 

[Killed] Block removal mutation
Meetings/MeetingWaitlistMember.cs:56:9
         }
 
         internal bool IsActive()
-        {
-            return !_isSignedOff && !_isMovedToAttendees;
-        }
+        {}
 
         internal void SignOff()

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/MeetingWaitlistMember.cs:57:37
 
         internal bool IsActive()
         {
-            return !_isSignedOff && !_isMovedToAttendees;
+            return !_isSignedOff && _isMovedToAttendees;
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/MeetingWaitlistMember.cs:57:20
 
         internal bool IsActive()
         {
-            return !_isSignedOff && !_isMovedToAttendees;
+            return _isSignedOff  && !_isMovedToAttendees;
         }
 

[Killed] Block removal mutation
Meetings/MeetingWaitlistMember.cs:61:9
         }
 
         internal void SignOff()
-        {
-            _isSignedOff = true;
-            _signOffDate = SystemClock.Now;
-
-            this.AddDomainEvent(new MemberSignedOffFromMeetingWaitlistDomainEvent(this.MeetingId, this.MemberId));
-        }
+        {}
     }
 }

[Survived] Boolean mutation
Meetings/MeetingWaitlistMember.cs:62:28
 
         internal void SignOff()
         {
-            _isSignedOff = true;
+            _isSignedOff = false;
             _signOffDate = SystemClock.Now;
 

[Killed] Statement mutation
Meetings/MeetingWaitlistMember.cs:65:13
             _isSignedOff = true;
             _signOffDate = SystemClock.Now;
 
-            this.AddDomainEvent(new MemberSignedOffFromMeetingWaitlistDomainEvent(this.MeetingId, this.MemberId));
+            ;
         }
     }
