[NoCoverage] Block removal mutation
Meetings/MoneyValue.cs:14:9
         public string Currency { get; }
 
         public static MoneyValue Of(decimal value, string currency)
-        {
-            return new MoneyValue(value, currency);
-        }
+        {}
 
         private MoneyValue(decimal? value, string currency)

[Survived] Block removal mutation
Meetings/MoneyValue.cs:19:9
         }
 
         private MoneyValue(decimal? value, string currency)
-        {
-            this.Value = value;
-            this.Currency = currency;
-        }
+        {}
 
         public static MoneyValue operator *(int left, MoneyValue right)

[NoCoverage] Block removal mutation
Meetings/MoneyValue.cs:25:9
         }
 
         public static MoneyValue operator *(int left, MoneyValue right)
-        {
-            return new MoneyValue(right.Value * left, right.Currency);
-        }
+        {}
     }
 }

[NoCoverage] Arithmetic mutation
Meetings/MoneyValue.cs:26:35
 
         public static MoneyValue operator *(int left, MoneyValue right)
         {
-            return new MoneyValue(right.Value * left, right.Currency);
+            return new MoneyValue(right.Value / left, right.Currency);
         }
     }
