[Killed] Block removal mutation
Meetings/Rules/AttendeeCanBeAddedOnlyInRsvpTermRule.cs:12:9
         private readonly Term _rsvpTerm;
 
         internal AttendeeCanBeAddedOnlyInRsvpTermRule(Term rsvpTerm)
-        {
-            _rsvpTerm = rsvpTerm;
-        }
+        {}
 
         public bool IsBroken() => !_rsvpTerm.IsInTerm(SystemClock.Now);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/Rules/AttendeeCanBeAddedOnlyInRsvpTermRule.cs:16:35
             _rsvpTerm = rsvpTerm;
         }
 
-        public bool IsBroken() => !_rsvpTerm.IsInTerm(SystemClock.Now);
+        public bool IsBroken() => _rsvpTerm.IsInTerm(SystemClock.Now);
 
         public string Message => "Attendee can be added only in RSVP term";
