[NoCoverage] Block removal mutation
Meetings/Rules/AttendeesLimitCannotBeChangedToSmallerThanActiveAttendeesRule.cs:14:9
         internal AttendeesLimitCannotBeChangedToSmallerThanActiveAttendeesRule(
             MeetingLimits meetingLimits,
             int allActiveAttendeesWithGuestsNumber)
-        {
-            this._attendeesLimit = meetingLimits.AttendeesLimit;
-            this._allActiveAttendeesWithGuestsNumber = allActiveAttendeesWithGuestsNumber;
-        }
+        {}
 
         public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber;

[NoCoverage] Equality mutation
Meetings/Rules/AttendeesLimitCannotBeChangedToSmallerThanActiveAttendeesRule.cs:19:63
             this._allActiveAttendeesWithGuestsNumber = allActiveAttendeesWithGuestsNumber;
         }
 
-        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber;
+        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value <= _allActiveAttendeesWithGuestsNumber;
 
         public string Message => "Attendees limit cannot be change to smaller than active attendees number";

[NoCoverage] Logical mutation
Meetings/Rules/AttendeesLimitCannotBeChangedToSmallerThanActiveAttendeesRule.cs:19:35
             this._allActiveAttendeesWithGuestsNumber = allActiveAttendeesWithGuestsNumber;
         }
 
-        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber;
+        public bool IsBroken() => _attendeesLimit.HasValue || _attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber;
 
         public string Message => "Attendees limit cannot be change to smaller than active attendees number";

[NoCoverage] String mutation
Meetings/Rules/AttendeesLimitCannotBeChangedToSmallerThanActiveAttendeesRule.cs:21:34
 
         public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber;
 
-        public string Message => "Attendees limit cannot be change to smaller than active attendees number";
+        public string Message => "";
     }
 }
