[Killed] Block removal mutation
Meetings/Rules/MeetingAttendeeMustBeAMemberOfGroupRule.cs:14:9
         private readonly MemberId _attendeeId;
 
         internal MeetingAttendeeMustBeAMemberOfGroupRule(MemberId attendeeId, MeetingGroup meetingGroup)
-        {
-            _attendeeId = attendeeId;
-            _meetingGroup = meetingGroup;
-        }
+        {}
 
         public bool IsBroken()

[Killed] Block removal mutation
Meetings/Rules/MeetingAttendeeMustBeAMemberOfGroupRule.cs:20:9
         }
 
         public bool IsBroken()
-        {
-            return !_meetingGroup.IsMemberOfGroup(_attendeeId);
-        }
+        {}
 
         public string Message => "Meeting attendee must be a member of group";

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/Rules/MeetingAttendeeMustBeAMemberOfGroupRule.cs:21:20
 
         public bool IsBroken()
         {
-            return !_meetingGroup.IsMemberOfGroup(_attendeeId);
+            return _meetingGroup.IsMemberOfGroup(_attendeeId);
         }
 
