[Killed] Block removal mutation
Meetings/Rules/MeetingAttendeesLimitCannotBeNegativeRule.cs:10:9
         private readonly int? _attendeesLimit;
 
         public MeetingAttendeesLimitCannotBeNegativeRule(int? attendeesLimit)
-        {
-            _attendeesLimit = attendeesLimit;
-        }
+        {}
 
         public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < 0;

[Killed] Equality mutation
Meetings/Rules/MeetingAttendeesLimitCannotBeNegativeRule.cs:14:63
             _attendeesLimit = attendeesLimit;
         }
 
-        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < 0;
+        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value > 0;
 
         public string Message => "Attendees limit cannot be negative";

[Killed] Logical mutation
Meetings/Rules/MeetingAttendeesLimitCannotBeNegativeRule.cs:14:35
             _attendeesLimit = attendeesLimit;
         }
 
-        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < 0;
+        public bool IsBroken() => _attendeesLimit.HasValue || _attendeesLimit.Value < 0;
 
         public string Message => "Attendees limit cannot be negative";
