[Killed] Block removal mutation
Meetings/Rules/MeetingAttendeesLimitMustBeGreaterThanGuestsLimitRule.cs:12:9
         private readonly int _guestsLimit;
 
         public MeetingAttendeesLimitMustBeGreaterThanGuestsLimitRule(int? attendeesLimit, int guestsLimit)
-        {
-            _attendeesLimit = attendeesLimit;
-            _guestsLimit = guestsLimit;
-        }
+        {}
 
         public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < _guestsLimit;

[Killed] Equality mutation
Meetings/Rules/MeetingAttendeesLimitMustBeGreaterThanGuestsLimitRule.cs:17:63
             _guestsLimit = guestsLimit;
         }
 
-        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < _guestsLimit;
+        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value > _guestsLimit;
 
         public string Message => "Attendees limit must be greater than guests limit";

[Killed] Logical mutation
Meetings/Rules/MeetingAttendeesLimitMustBeGreaterThanGuestsLimitRule.cs:17:35
             _guestsLimit = guestsLimit;
         }
 
-        public bool IsBroken() => _attendeesLimit.HasValue && _attendeesLimit.Value < _guestsLimit;
+        public bool IsBroken() => _attendeesLimit.HasValue || _attendeesLimit.Value < _guestsLimit;
 
         public string Message => "Attendees limit must be greater than guests limit";
