[Killed] Block removal mutation
Meetings/Rules/MeetingAttendeesNumberIsAboveLimitRule.cs:17:9
             int? attendeesLimit,
             int allActiveAttendeesWithGuestsNumber,
             int guestsNumber)
-        {
-            _attendeesLimit = attendeesLimit;
-            _allActiveAttendeesWithGuestsNumber = allActiveAttendeesWithGuestsNumber;
-            _guestsNumber = guestsNumber;
-        }
+        {}
 
         public bool IsBroken() => this._attendeesLimit.HasValue &&

[Killed] Logical mutation
Meetings/Rules/MeetingAttendeesNumberIsAboveLimitRule.cs:23:35
             _guestsNumber = guestsNumber;
         }
 
-        public bool IsBroken() => this._attendeesLimit.HasValue &&
-                                  this._attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber + 1 + _guestsNumber;
+        public bool IsBroken() => this._attendeesLimit.HasValue ||
+                                  this._attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber + 1 + _guestsNumber;
 
         public string Message => "Meeting attendees number is above limit";

[Killed] Equality mutation
Meetings/Rules/MeetingAttendeesNumberIsAboveLimitRule.cs:24:35
         }
 
         public bool IsBroken() => this._attendeesLimit.HasValue &&
-                                  this._attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber + 1 + _guestsNumber;
+                                                                    this._attendeesLimit.Value > _allActiveAttendeesWithGuestsNumber + 1 + _guestsNumber;
 
         public string Message => "Meeting attendees number is above limit";

[Killed] Equality mutation
Meetings/Rules/MeetingAttendeesNumberIsAboveLimitRule.cs:24:35
         }
 
         public bool IsBroken() => this._attendeesLimit.HasValue &&
-                                  this._attendeesLimit.Value < _allActiveAttendeesWithGuestsNumber + 1 + _guestsNumber;
+                                                                    this._attendeesLimit.Value <= _allActiveAttendeesWithGuestsNumber + 1 + _guestsNumber;
 
         public string Message => "Meeting attendees number is above limit";
