[Killed] Block removal mutation
Meetings/Rules/MeetingCannotBeChangedAfterStartRule.cs:10:9
         private readonly MeetingTerm _meetingTerm;
 
         public MeetingCannotBeChangedAfterStartRule(MeetingTerm meetingTerm)
-        {
-            _meetingTerm = meetingTerm;
-        }
+        {}
 
         public bool IsBroken() => _meetingTerm.IsAfterStart();

[Survived] String mutation
Meetings/Rules/MeetingCannotBeChangedAfterStartRule.cs:16:34
 
         public bool IsBroken() => _meetingTerm.IsAfterStart();
 
-        public string Message => "Meeting cannot be changed after start";
+        public string Message => "";
     }
 }
