[Killed] Block removal mutation
Meetings/Rules/MeetingGuestsLimitCannotBeNegativeRule.cs:10:9
         private readonly int _guestsLimit;
 
         public MeetingGuestsLimitCannotBeNegativeRule(int guestsLimit)
-        {
-            _guestsLimit = guestsLimit;
-        }
+        {}
 
         public bool IsBroken() => _guestsLimit < 0;

[Killed] Equality mutation
Meetings/Rules/MeetingGuestsLimitCannotBeNegativeRule.cs:14:35
             _guestsLimit = guestsLimit;
         }
 
-        public bool IsBroken() => _guestsLimit < 0;
+        public bool IsBroken() => _guestsLimit <= 0;
 
         public string Message => "Guests limit cannot be negative";

[Killed] Equality mutation
Meetings/Rules/MeetingGuestsLimitCannotBeNegativeRule.cs:14:35
             _guestsLimit = guestsLimit;
         }
 
-        public bool IsBroken() => _guestsLimit < 0;
+        public bool IsBroken() => _guestsLimit > 0;
 
         public string Message => "Guests limit cannot be negative";

[Survived] String mutation
Meetings/Rules/MeetingGuestsLimitCannotBeNegativeRule.cs:16:34
 
         public bool IsBroken() => _guestsLimit < 0;
 
-        public string Message => "Guests limit cannot be negative";
+        public string Message => "";
     }
 }
