[Killed] Block removal mutation
Meetings/Rules/MeetingGuestsNumberIsAboveLimitRule.cs:12:9
         private readonly int _guestsLimit;
 
         public MeetingGuestsNumberIsAboveLimitRule(int guestsLimit, int guestsNumber)
-        {
-            _guestsNumber = guestsNumber;
-            _guestsLimit = guestsLimit;
-        }
+        {}
 
         public bool IsBroken() => this._guestsLimit > 0 && this._guestsLimit < _guestsNumber;

[Killed] Equality mutation
Meetings/Rules/MeetingGuestsNumberIsAboveLimitRule.cs:17:35
             _guestsLimit = guestsLimit;
         }
 
-        public bool IsBroken() => this._guestsLimit > 0 && this._guestsLimit < _guestsNumber;
+        public bool IsBroken() => this._guestsLimit >= 0  && this._guestsLimit < _guestsNumber;
 
         public string Message => "Meeting guests number is above limit";

[Killed] Equality mutation
Meetings/Rules/MeetingGuestsNumberIsAboveLimitRule.cs:17:60
             _guestsLimit = guestsLimit;
         }
 
-        public bool IsBroken() => this._guestsLimit > 0 && this._guestsLimit < _guestsNumber;
+        public bool IsBroken() => this._guestsLimit > 0 && this._guestsLimit > _guestsNumber;
 
         public string Message => "Meeting guests number is above limit";

[Survived] String mutation
Meetings/Rules/MeetingGuestsNumberIsAboveLimitRule.cs:19:34
 
         public bool IsBroken() => this._guestsLimit > 0 && this._guestsLimit < _guestsNumber;
 
-        public string Message => "Meeting guests number is above limit";
+        public string Message => "";
     }
 }
