[Killed] Block removal mutation
Meetings/Rules/MeetingMustHaveAtLeastOneHostRule.cs:10:9
         private readonly int _meetingHostNumber;
 
         public MeetingMustHaveAtLeastOneHostRule(int meetingHostNumber)
-        {
-            _meetingHostNumber = meetingHostNumber;
-        }
+        {}
 
         public bool IsBroken() => _meetingHostNumber == 0;

[Killed] Equality mutation
Meetings/Rules/MeetingMustHaveAtLeastOneHostRule.cs:14:35
             _meetingHostNumber = meetingHostNumber;
         }
 
-        public bool IsBroken() => _meetingHostNumber == 0;
+        public bool IsBroken() => _meetingHostNumber != 0;
 
         public string Message => "Meeting must have at least one host";
