[Killed] Block removal mutation
Meetings/Rules/MemberCannotBeAnAttendeeOfMeetingMoreThanOnceRule.cs:15:9
         private readonly List<MeetingAttendee> _attendees;
 
         public MemberCannotBeAnAttendeeOfMeetingMoreThanOnceRule(MemberId attendeeId, List<MeetingAttendee> attendees)
-        {
-            this._attendeeId = attendeeId;
-            _attendees = attendees;
-        }
+        {}
 
         public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_attendeeId)) != null;

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Rules/MemberCannotBeAnAttendeeOfMeetingMoreThanOnceRule.cs:20:35
             _attendees = attendees;
         }
 
-        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_attendeeId)) != null;
+        public bool IsBroken() => _attendees.Single(x => x.IsActiveAttendee(_attendeeId))  != null;
 
         public string Message => "Member is already an attendee of this meeting";

[Killed] Equality mutation
Meetings/Rules/MemberCannotBeAnAttendeeOfMeetingMoreThanOnceRule.cs:20:35
             _attendees = attendees;
         }
 
-        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_attendeeId)) != null;
+        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_attendeeId)) == null;
 
         public string Message => "Member is already an attendee of this meeting";
