[Killed] Block removal mutation
Meetings/Rules/MemberCannotBeMoreThanOnceOnMeetingWaitlistRule.cs:15:9
         private readonly MemberId _memberId;
 
         internal MemberCannotBeMoreThanOnceOnMeetingWaitlistRule(List<MeetingWaitlistMember> waitListMembers, MemberId memberId)
-        {
-            _waitListMembers = waitListMembers;
-            _memberId = memberId;
-        }
+        {}
 
         public bool IsBroken() => _waitListMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) != null;

[Killed] Equality mutation
Meetings/Rules/MemberCannotBeMoreThanOnceOnMeetingWaitlistRule.cs:20:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => _waitListMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) != null;
+        public bool IsBroken() => _waitListMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) == null;
 
         public string Message => "Member cannot be more than once on the meeting waitlist";

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Rules/MemberCannotBeMoreThanOnceOnMeetingWaitlistRule.cs:20:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => _waitListMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) != null;
+        public bool IsBroken() => _waitListMembers.Single(x => x.IsActiveOnWaitList(_memberId))  != null;
 
         public string Message => "Member cannot be more than once on the meeting waitlist";

[Survived] String mutation
Meetings/Rules/MemberCannotBeMoreThanOnceOnMeetingWaitlistRule.cs:22:34
 
         public bool IsBroken() => _waitListMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) != null;
 
-        public string Message => "Member cannot be more than once on the meeting waitlist";
+        public string Message => "";
     }
 }
