[Killed] Block removal mutation
Meetings/Rules/MemberCannotBeNotAttendeeTwiceRule.cs:15:9
         private readonly MemberId _memberId;
 
         public MemberCannotBeNotAttendeeTwiceRule(List<MeetingNotAttendee> notAttendees, MemberId memberId)
-        {
-            _notAttendees = notAttendees;
-            _memberId = memberId;
-        }
+        {}
 
         public bool IsBroken() => _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(_memberId)) != null;

[Killed] Equality mutation
Meetings/Rules/MemberCannotBeNotAttendeeTwiceRule.cs:20:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(_memberId)) != null;
+        public bool IsBroken() => _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(_memberId)) == null;
 
         public string Message => "Member cannot be active not attendee twice";

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Rules/MemberCannotBeNotAttendeeTwiceRule.cs:20:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(_memberId)) != null;
+        public bool IsBroken() => _notAttendees.Single(x => x.IsActiveNotAttendee(_memberId))  != null;
 
         public string Message => "Member cannot be active not attendee twice";
