[Killed] Block removal mutation
Meetings/Rules/MemberCannotHaveSetAttendeeRoleMoreThanOnceRule.cs:10:9
         private readonly MeetingAttendeeRole _meetingAttendeeRole;
 
         internal MemberCannotHaveSetAttendeeRoleMoreThanOnceRule(MeetingAttendeeRole meetingAttendeeRole)
-        {
-            _meetingAttendeeRole = meetingAttendeeRole;
-        }
+        {}
 
         public bool IsBroken() => _meetingAttendeeRole == MeetingAttendeeRole.Attendee;

[Killed] Equality mutation
Meetings/Rules/MemberCannotHaveSetAttendeeRoleMoreThanOnceRule.cs:14:35
             _meetingAttendeeRole = meetingAttendeeRole;
         }
 
-        public bool IsBroken() => _meetingAttendeeRole == MeetingAttendeeRole.Attendee;
+        public bool IsBroken() => _meetingAttendeeRole != MeetingAttendeeRole.Attendee;
 
         public string Message => "Member cannot be attendee of meeting more than once";

[Survived] String mutation
Meetings/Rules/MemberCannotHaveSetAttendeeRoleMoreThanOnceRule.cs:16:34
 
         public bool IsBroken() => _meetingAttendeeRole == MeetingAttendeeRole.Attendee;
 
-        public string Message => "Member cannot be attendee of meeting more than once";
+        public string Message => "";
     }
 }
