[Killed] Block removal mutation
Meetings/Rules/MemberOnWaitlistMustBeAMemberOfGroupRule.cs:18:9
 
         internal MemberOnWaitlistMustBeAMemberOfGroupRule(MeetingGroup meetingGroup, MemberId memberId, List<MeetingAttendee> attendees)
             : base()
-        {
-            _meetingGroup = meetingGroup;
-            _memberId = memberId;
-            _attendees = attendees;
-        }
+        {}
 
         public bool IsBroken() => !_meetingGroup.IsMemberOfGroup(_memberId);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/Rules/MemberOnWaitlistMustBeAMemberOfGroupRule.cs:24:35
             _attendees = attendees;
         }
 
-        public bool IsBroken() => !_meetingGroup.IsMemberOfGroup(_memberId);
+        public bool IsBroken() => _meetingGroup.IsMemberOfGroup(_memberId);
 
         public string Message => "Member on waitlist must be a member of group";
