[Killed] Block removal mutation
Meetings/Rules/NotActiveMemberOfWaitlistCannotBeSignedOffRule.cs:15:9
         private readonly MemberId _memberId;
 
         public NotActiveMemberOfWaitlistCannotBeSignedOffRule(List<MeetingWaitlistMember> waitlistMembers, MemberId memberId)
-        {
-            _waitlistMembers = waitlistMembers;
-            _memberId = memberId;
-        }
+        {}
 
         public bool IsBroken() => _waitlistMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) == null;

[Killed] Equality mutation
Meetings/Rules/NotActiveMemberOfWaitlistCannotBeSignedOffRule.cs:20:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => _waitlistMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) == null;
+        public bool IsBroken() => _waitlistMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) != null;
 
         public string Message => "Not active member of waitlist cannot be signed off";

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Rules/NotActiveMemberOfWaitlistCannotBeSignedOffRule.cs:20:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => _waitlistMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) == null;
+        public bool IsBroken() => _waitlistMembers.Single(x => x.IsActiveOnWaitList(_memberId))  == null;
 
         public string Message => "Not active member of waitlist cannot be signed off";

[Survived] String mutation
Meetings/Rules/NotActiveMemberOfWaitlistCannotBeSignedOffRule.cs:22:34
 
         public bool IsBroken() => _waitlistMembers.SingleOrDefault(x => x.IsActiveOnWaitList(_memberId)) == null;
 
-        public string Message => "Not active member of waitlist cannot be signed off";
+        public string Message => "";
     }
 }
