[Killed] Block removal mutation
Meetings/Rules/NotActiveNotAttendeeCannotChangeDecisionRule.cs:15:9
         private readonly MemberId _memberId;
 
         internal NotActiveNotAttendeeCannotChangeDecisionRule(List<MeetingNotAttendee> notAttendees, MemberId memberId)
-        {
-            _notAttendees = notAttendees;
-            _memberId = memberId;
-        }
+        {}
 
         public bool IsBroken() => _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(_memberId)) == null;

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Rules/NotActiveNotAttendeeCannotChangeDecisionRule.cs:20:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(_memberId)) == null;
+        public bool IsBroken() => _notAttendees.Single(x => x.IsActiveNotAttendee(_memberId))  == null;
 
         public string Message => "Member is not active not attendee";

[Killed] Equality mutation
Meetings/Rules/NotActiveNotAttendeeCannotChangeDecisionRule.cs:20:35
             _memberId = memberId;
         }
 
-        public bool IsBroken() => _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(_memberId)) == null;
+        public bool IsBroken() => _notAttendees.SingleOrDefault(x => x.IsActiveNotAttendee(_memberId)) != null;
 
         public string Message => "Member is not active not attendee";
