[Killed] Block removal mutation
Meetings/Rules/OnlyActiveAttendeeCanBeRemovedFromMeetingRule.cs:16:9
         internal OnlyActiveAttendeeCanBeRemovedFromMeetingRule(
             List<MeetingAttendee> attendees,
             MemberId attendeeId)
-        {
-            _attendees = attendees;
-            _attendeeId = attendeeId;
-        }
+        {}
 
         public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_attendeeId)) == null;

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Rules/OnlyActiveAttendeeCanBeRemovedFromMeetingRule.cs:21:35
             _attendeeId = attendeeId;
         }
 
-        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_attendeeId)) == null;
+        public bool IsBroken() => _attendees.Single(x => x.IsActiveAttendee(_attendeeId))  == null;
 
         public string Message => "Only active attendee can be removed from meeting";

[Killed] Equality mutation
Meetings/Rules/OnlyActiveAttendeeCanBeRemovedFromMeetingRule.cs:21:35
             _attendeeId = attendeeId;
         }
 
-        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_attendeeId)) == null;
+        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_attendeeId)) != null;
 
         public string Message => "Only active attendee can be removed from meeting";
