[Killed] Block removal mutation
Meetings/Rules/OnlyMeetingAttendeeCanHaveChangedRoleRule.cs:15:9
         private readonly MemberId _newOrganizerId;
 
         internal OnlyMeetingAttendeeCanHaveChangedRoleRule(List<MeetingAttendee> attendees, MemberId newOrganizerId)
-        {
-            _attendees = attendees;
-            _newOrganizerId = newOrganizerId;
-        }
+        {}
 
         public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_newOrganizerId)) == null;

[Killed] Equality mutation
Meetings/Rules/OnlyMeetingAttendeeCanHaveChangedRoleRule.cs:20:35
             _newOrganizerId = newOrganizerId;
         }
 
-        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_newOrganizerId)) == null;
+        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_newOrganizerId)) != null;
 
         public string Message => "Only meeting attendee can be se as organizer of meeting";

[Survived] Linq method mutation (SingleOrDefault() to Single())
Meetings/Rules/OnlyMeetingAttendeeCanHaveChangedRoleRule.cs:20:35
             _newOrganizerId = newOrganizerId;
         }
 
-        public bool IsBroken() => _attendees.SingleOrDefault(x => x.IsActiveAttendee(_newOrganizerId)) == null;
+        public bool IsBroken() => _attendees.Single(x => x.IsActiveAttendee(_newOrganizerId))  == null;
 
         public string Message => "Only meeting attendee can be se as organizer of meeting";
