[Killed] Block removal mutation
Meetings/Rules/OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule.cs:16:9
         private readonly List<MeetingAttendee> _attendees;
 
         public OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule(MemberId settingMemberId, MeetingGroup meetingGroup, List<MeetingAttendee> attendees)
-        {
-            _settingMemberId = settingMemberId;
-            _meetingGroup = meetingGroup;
-            _attendees = attendees;
-        }
+        {}
 
         public bool IsBroken()

[Killed] Block removal mutation
Meetings/Rules/OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule.cs:23:9
         }
 
         public bool IsBroken()
-        {
-            var settingMember = _attendees.SingleOrDefault(x => x.IsActiveAttendee(_settingMemberId));
-
-            var isHost = settingMember != null && settingMember.IsActiveHost();
-            var isOrganizer = _meetingGroup.IsOrganizer(_settingMemberId);
-
-            return !isHost && !isOrganizer;
-        }
+        {}
 
         public string Message => "Only meeting host or group organizer can set meeting member roles";

[Killed] Linq method mutation (SingleOrDefault() to Single())
Meetings/Rules/OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule.cs:24:33
 
         public bool IsBroken()
         {
-            var settingMember = _attendees.SingleOrDefault(x => x.IsActiveAttendee(_settingMemberId));
+            var settingMember = _attendees.Single(x => x.IsActiveAttendee(_settingMemberId));
 
             var isHost = settingMember != null && settingMember.IsActiveHost();

[Killed] Equality mutation
Meetings/Rules/OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule.cs:26:26
         {
             var settingMember = _attendees.SingleOrDefault(x => x.IsActiveAttendee(_settingMemberId));
 
-            var isHost = settingMember != null && settingMember.IsActiveHost();
+            var isHost = settingMember == null  && settingMember.IsActiveHost();
             var isOrganizer = _meetingGroup.IsOrganizer(_settingMemberId);
 

[Killed] Logical mutation
Meetings/Rules/OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule.cs:26:26
         {
             var settingMember = _attendees.SingleOrDefault(x => x.IsActiveAttendee(_settingMemberId));
 
-            var isHost = settingMember != null && settingMember.IsActiveHost();
+            var isHost = settingMember != null || settingMember.IsActiveHost();
             var isOrganizer = _meetingGroup.IsOrganizer(_settingMemberId);
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/Rules/OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule.cs:29:20
             var isHost = settingMember != null && settingMember.IsActiveHost();
             var isOrganizer = _meetingGroup.IsOrganizer(_settingMemberId);
 
-            return !isHost && !isOrganizer;
+            return isHost  && !isOrganizer;
         }
 

[Killed] Logical mutation
Meetings/Rules/OnlyMeetingOrGroupOrganizerCanSetMeetingMemberRolesRule.cs:29:20
             var isHost = settingMember != null && settingMember.IsActiveHost();
             var isOrganizer = _meetingGroup.IsOrganizer(_settingMemberId);
 
-            return !isHost && !isOrganizer;
+            return !isHost || !isOrganizer;
         }
 
