[Killed] Block removal mutation
Meetings/Rules/ReasonOfRemovingAttendeeFromMeetingMustBeProvidedRule.cs:10:9
         private readonly string _reason;
 
         internal ReasonOfRemovingAttendeeFromMeetingMustBeProvidedRule(string reason)
-        {
-            _reason = reason;
-        }
+        {}
 
         public bool IsBroken() => string.IsNullOrEmpty(_reason);
