[Killed] Block removal mutation
Meetings/Term.cs:15:9
         public DateTime? EndDate { get; }
 
         public static Term CreateNewBetweenDates(DateTime? startDate, DateTime? endDate)
-        {
-            return new Term(startDate, endDate);
-        }
+        {}
 
         private Term(DateTime? startDate, DateTime? endDate)

[Killed] Block removal mutation
Meetings/Term.cs:20:9
         }
 
         private Term(DateTime? startDate, DateTime? endDate)
-        {
-            this.StartDate = startDate;
-            this.EndDate = endDate;
-        }
+        {}
 
         internal bool IsInTerm(DateTime date)

[Killed] Block removal mutation
Meetings/Term.cs:26:9
         }
 
         internal bool IsInTerm(DateTime date)
-        {
-            var left = !this.StartDate.HasValue || this.StartDate.Value <= date;
-
-            var right = !this.EndDate.HasValue || this.EndDate.Value >= date;
-
-            return left && right;
-        }
+        {}
     }
 }

[Killed] Logical mutation
Meetings/Term.cs:27:24
 
         internal bool IsInTerm(DateTime date)
         {
-            var left = !this.StartDate.HasValue || this.StartDate.Value <= date;
+            var left = !this.StartDate.HasValue && this.StartDate.Value <= date;
 
             var right = !this.EndDate.HasValue || this.EndDate.Value >= date;

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/Term.cs:27:24
 
         internal bool IsInTerm(DateTime date)
         {
-            var left = !this.StartDate.HasValue || this.StartDate.Value <= date;
+            var left = this.StartDate.HasValue  || this.StartDate.Value <= date;
 
             var right = !this.EndDate.HasValue || this.EndDate.Value >= date;

[Killed] Equality mutation
Meetings/Term.cs:29:51
         {
             var left = !this.StartDate.HasValue || this.StartDate.Value <= date;
 
-            var right = !this.EndDate.HasValue || this.EndDate.Value >= date;
+            var right = !this.EndDate.HasValue || this.EndDate.Value < date;
 
             return left && right;

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Meetings/Term.cs:29:25
         {
             var left = !this.StartDate.HasValue || this.StartDate.Value <= date;
 
-            var right = !this.EndDate.HasValue || this.EndDate.Value >= date;
+            var right = this.EndDate.HasValue  || this.EndDate.Value >= date;
 
             return left && right;

[Killed] Logical mutation
Meetings/Term.cs:31:20
 
             var right = !this.EndDate.HasValue || this.EndDate.Value >= date;
 
-            return left && right;
+            return left || right;
         }
     }
