[Killed] Block removal mutation
Members/Events/MemberCreatedDomainEvent.cs:10:9
         public MemberId MemberId { get; }
 
         public MemberCreatedDomainEvent(MemberId memberId)
-        {
-            MemberId = memberId;
-        }
+        {}
     }
 }
