[Survived] Block removal mutation
Members/MeetingGroupMemberData.cs:12:9
         public MemberId MemberId { get; }
 
         public MeetingGroupMemberData(MeetingGroupId meetingGroupId, MemberId memberId)
-        {
-            MemberId = memberId;
-            MeetingGroupId = meetingGroupId;
-        }
+        {}
     }
 }
