[Killed] Block removal mutation
Members/Member.cs:32:9
         }
 
         public static Member Create(Guid id, string login, string email, string firstName, string lastName, string name)
-        {
-            return new Member(id, login, email, firstName, lastName, name);
-        }
+        {}
 
         private Member(Guid id, string login, string email, string firstName, string lastName, string name)

[Killed] Block removal mutation
Members/Member.cs:37:9
         }
 
         private Member(Guid id, string login, string email, string firstName, string lastName, string name)
-        {
-            this.Id = new MemberId(id);
-            _login = login;
-            _email = email;
-            _firstName = firstName;
-            _lastName = lastName;
-            _name = name;
-            _createDate = SystemClock.Now;
-
-            this.AddDomainEvent(new MemberCreatedDomainEvent(this.Id));
-        }
+        {}
     }
 }

[Killed] Statement mutation
Members/Member.cs:46:13
             _name = name;
             _createDate = SystemClock.Now;
 
-            this.AddDomainEvent(new MemberCreatedDomainEvent(this.Id));
+            ;
         }
     }
