[NoCoverage] Block removal mutation
Members/MemberSubscriptions/Events/MemberSubscriptionExpirationDateChangedDomainEvent.cs:9:9
     public class MemberSubscriptionExpirationDateChangedDomainEvent : DomainEventBase
     {
         public MemberSubscriptionExpirationDateChangedDomainEvent(MemberId memberId, DateTime expirationDate)
-        {
-            MemberId = memberId;
-            ExpirationDate = expirationDate;
-        }
+        {}
 
         public MemberId MemberId { get; }
