[NoCoverage] Block removal mutation
Members/MemberSubscriptions/MemberSubscription.cs:19:9
         }
 
         private MemberSubscription(MemberId memberId, DateTime expirationDate)
-        {
-            this.Id = new MemberSubscriptionId(memberId.Value);
-            _expirationDate = expirationDate;
-
-            this.AddDomainEvent(new MemberSubscriptionExpirationDateChangedDomainEvent(memberId, _expirationDate));
-        }
+        {}
 
         public static MemberSubscription CreateForMember(MemberId memberId, DateTime expirationDate)

[NoCoverage] Statement mutation
Members/MemberSubscriptions/MemberSubscription.cs:23:13
             this.Id = new MemberSubscriptionId(memberId.Value);
             _expirationDate = expirationDate;
 
-            this.AddDomainEvent(new MemberSubscriptionExpirationDateChangedDomainEvent(memberId, _expirationDate));
+            ;
         }
 

[NoCoverage] Block removal mutation
Members/MemberSubscriptions/MemberSubscription.cs:27:9
         }
 
         public static MemberSubscription CreateForMember(MemberId memberId, DateTime expirationDate)
-        {
-            return new MemberSubscription(memberId, expirationDate);
-        }
+        {}
 
         public void ChangeExpirationDate(DateTime expirationDate)

[NoCoverage] Block removal mutation
Members/MemberSubscriptions/MemberSubscription.cs:32:9
         }
 
         public void ChangeExpirationDate(DateTime expirationDate)
-        {
-            _expirationDate = expirationDate;
-
-            this.AddDomainEvent(new MemberSubscriptionExpirationDateChangedDomainEvent(
-                new MemberId(this.Id.Value),
-                _expirationDate));
-        }
+        {}
     }
 }

[NoCoverage] Statement mutation
Members/MemberSubscriptions/MemberSubscription.cs:35:13
         {
             _expirationDate = expirationDate;
 
-            this.AddDomainEvent(new MemberSubscriptionExpirationDateChangedDomainEvent(
-                new MemberId(this.Id.Value),
-                _expirationDate));
+            ;
         }
     }
