[Killed] Block removal mutation
SharedKernel/SystemClock.cs:12:13
         public static DateTime Now
         {
             get
-            {
-                if (_customDate.HasValue)
-                {
-                    return _customDate.Value;
-                }
-
-                return DateTime.UtcNow;
-            }
+            {}
         }
 

[Killed] Negate expression
SharedKernel/SystemClock.cs:13:21
         {
             get
             {
-                if (_customDate.HasValue)
+                if (!(_customDate.HasValue))
                 {
                     return _customDate.Value;

[Killed] Block removal mutation
SharedKernel/SystemClock.cs:14:17
             get
             {
                 if (_customDate.HasValue)
-                {
-                    return _customDate.Value;
-                }
+                {}
 
                 return DateTime.UtcNow;
